[
    {
        "nominee": "Allen,Rebecca",
        "unit": "Development - UW Medicine",
        "quote": "Rebecca is passionate about DEI and has raised 7 figure gifts to support research to reduce disparities in cancer research and care. It is a pleasure to collaborate with her because she freely shares work and credit in order to raise significant gifts"
    },
    {
        "nominee": "Team,Business Analyst",
        "unit": "Advancement Operations - IM",
        "quote": "The IM Business Analyst Team (Gunnar Berg, Sarah Maloy and Lisa Vargaas) exudes collaboration and excellence for their work on getting UA ready for Tandem. From their hard work (and many others), it's clear that we will have a top notch product launching in April."
    },
    {
        "nominee": "Bailey,Lindsay",
        "unit": "Development - CAS",
        "quote": "Lindsay is someone you're glad to have on the email chain & never have to worry she won't see & reply to your teams message. "
    },
    {
        "nominee": "Barnett,Michelle",
        "unit": "Development - CFR",
        "quote": "The Advancement Values were written about Michelle Barnett's team-centric and impactful work ethic: She leans in to start and finish critical tasks, she ensures donors and corporate partners see our best work and best foot forward, and she amplifies our impact by supporting gifts from $100 up to $1,000,000 across the University. "
    },
    {
        "nominee": "Berg,Gunnar",
        "unit": "Advancement Operations - IM",
        "quote": "Gunnary collaborated with us and the Tandem developer to figure out how to build contact reports in the new CRM. His commitment to translating our needs into developer-speak, quickly and accurately, is so valuable!"
    },
    {
        "nominee": "Blake,Tomitha ",
        "unit": "Development - ASA",
        "quote": "She is exceedingly smart, enthusiastic about the work ASA accomplishes, is strategically-minded, donor focused and an absolute joy to work with. "
    },
    {
        "nominee": "Bucholtz,Michelle",
        "unit": "Advancement Operations - F&A",
        "quote": "Michelle's management style appears effortless yet is very effective."
    },
    {
        "nominee": "Bush,Heidi",
        "unit": "Development - ICA",
        "quote": "Heidi comes with a \"can do\" attitude, a huge smile and a larger sense of team and University in all she does. She believes deeply in our Student Athletes experience and works each and every day, often against many challenges, to bring our fans and donors together to feel the impact."
    },
    {
        "nominee": "Caple,Lauren",
        "unit": "UMAC",
        "quote": "Lauren is a leader and a hard worker, setting a great example for all of us. Her courage, clarity and commitment to staying focused on the best possible results show us what can be accomplished when we match our values to our actions."
    },
    {
        "nominee": "Cleland,Todd",
        "unit": "Development - CFR",
        "quote": "Todd has brought innovation and positive changes to the way UW does corporate relations for the past decade, and several of the programs he launched are thriving today. Importantly, ‘Todd conducts his work in a very collaborative manner in which he treats colleagues, sponsors, and others with kindness, patience, good humor, and encouragement. We are thankful to have worked with him."
    },
    {
        "nominee": "Foss,Jessica",
        "unit": "Advancement Operations - F&A",
        "quote": "Jess has been doing an amazing job on our transition to the Future State. She learns how orgs are adapting their facilities for hybrid work and figures out how to meet people's needs."
    },
    {
        "nominee": "Garrand,Jaime",
        "unit": "UMAC",
        "quote": "Jaime is a highly accountable, dedicated professional who drives everybody around her to be their best. She's also a true team player who knows how to empathize, build bridges and look out for the greater good."
    },
    {
        "nominee": "Graves,Holly",
        "unit": "Development - CAS",
        "quote": "Holly’s vision and creativity in thinking about the College of Arts & Sciences social media content has made our platforms more viewed, more fun, and more interactive. It’s exciting to see how she is shaping the College’s branding for a variety of audiences!"
    },
    {
        "nominee": "Haas,Laura",
        "unit": "Development - SPH",
        "quote": "Laura’s approach to collaborative storytelling is inspiring. She brought the 50th Anniversary of the School of Public Health to life."
    },
    {
        "nominee": "Hamilton,Callie ",
        "unit": "Advancement Operations - IM",
        "quote": "Always works hard to go over beyond her role.  Thank you for all you do Callie!"
    },
    {
        "nominee": "Ingram,Megan",
        "unit": "Development - SPH",
        "quote": "Megan’s inclusive approach to leadership creates a dynamic synergy between Advancement and Communications teams — expanding the impact of the School of Public Health. "
    },
    {
        "nominee": "Jagannathan,Malavika",
        "unit": "UMAC",
        "quote": "UMAC is a better place thanks to Malavika's integrity, thoughtfulness, and intelligence--which she brings to every single project, no matter how big or small."
    },
    {
        "nominee": "Kreptul,Melissa ",
        "unit": "Office of the SVP for Advancement",
        "quote": "Melissa has the hardest job of all of us and this role is commonly overlooked. Supporting an SVP is not an easy feat and she does it with grace.  She is always calm and has everything under control."
    },
    {
        "nominee": "Krueger,Andrew",
        "unit": "Development - Foster",
        "quote": "Andrew Krueger has worked tirelessly throughout the era of social distancing to close the distances between Foster School alumni, students, faculty, staff, and friends. He opens doors and empowers others to build a better community for us all."
    },
    {
        "nominee": "Lee,Mike",
        "unit": "Development - CAS",
        "quote": "\"Of course, I can definitely help with that!\" - paraphrased quote from Mike. "
    },
    {
        "nominee": "LeSourd,Michelle",
        "unit": "Development - Regional",
        "quote": "Michelle is an outstanding colleague who is not only a star when it comes to her role as an Advancement Services Officer but is also playing a critical role in advancing equity and inclusion at the UW. "
    },
    {
        "nominee": "Maloy,Sarah",
        "unit": "Advancement Operations - IM",
        "quote": "Sarah and her team are committd to making Tandem work for all of us!"
    },
    {
        "nominee": "Matthews,Meg",
        "unit": "UMAC",
        "quote": "Meg Matthews is helping our University communities stay safe and informed as we return to our campuses, which is a continuation of years of work making the UW a better place."
    },
    {
        "nominee": "McQuate,Sarah",
        "unit": "UMAC",
        "quote": "Sarah brings a clear vision, a commitment to honesty and a great sense of humor to everything she does, steering UMAC's progress toward equity with a spirit of inclusion."
    },
    {
        "nominee": "Mercado,Elizar",
        "unit": "Development - SPH",
        "quote": "Elizar’s artistic design of the UW Public Health magazine - 50th Anniversary edition - hit it out of the ballpark."
    },
    {
        "nominee": "Nammathao,Napha",
        "unit": "ASE",
        "quote": "Napha is an example of Advancement excellence because of her commitment to advocating for diverse and equitable spaces, fostering community among peers, advocating for her student workers, and being a true team player throughout her many years with ASE. She is equally as professionally talented as she is a deeply authentic and welcoming colleague to all. "
    },
    {
        "nominee": "Nasman,Linnea",
        "unit": "Development - UW Medicine",
        "quote": "Linnea's work to launch the Engage program cannot be overstated. Without her diligent work and collaborative and strategic approach, the program would not be off to the wonderful success it is so far. Linnea is a star!"
    },
    {
        "nominee": "Naumann,John",
        "unit": "Development - UW Bothell",
        "quote": "John is a powerful champion of UW Bothell students and works tirelessly to bring corporate resources to campus."
    },
    {
        "nominee": "Ngo,Julie",
        "unit": "Advancement Operations - IM",
        "quote": "She goes above and beyond to help others. She is thoughtful, smart, and organized. "
    },
    {
        "nominee": "Peng,Qing",
        "unit": "Advancement Operations - F&A",
        "quote": "Qing is a highly motivated, positive and collaborative colleague."
    },
    {
        "nominee": "Rasmussen,Natalie ",
        "unit": "Development - UW Medicine",
        "quote": "What you may not know is that Natalie goes above and beyond for colleagues, faculty and donors on an hourly basis. That is not an exaggeration. We rely on Natalie for ALL the nuts and bolts things that make up Donor Relations, but fundraisers also go to Natalie because she is a strategic partner."
    },
    {
        "nominee": "Rasmussen,Natalie",
        "unit": "Development - UW Medicine",
        "quote": "Natalie has gone above and beyond to provide exceptional gift processing and donor stewardship support for our office during the pandemic, fully leveraging collaborations with her communications and events partners to make sure all donors feel thanked and see the impact of their giving."
    },
    {
        "nominee": "Team,Gift Services",
        "unit": "Advancement Operations - GS",
        "quote": "Advancement Operations power house team!!"
    },
    {
        "nominee": "Singh,Jessica",
        "unit": "UMAC",
        "quote": "Jessica is a stellar project manager and a true joy to work with everyday. She makes everyone around her, and everything she works on, better."
    },
    {
        "nominee": "Tran,An",
        "unit": "Development  - Regional",
        "quote": "'Nothing makes me more excited than when An has a prospect to partner with me on' - quote from me."
    },
    {
        "nominee": "Truong,Melissa",
        "unit": "Advancement Operations F&A",
        "quote": "If a task or project is not assigned to anyone but needs to be done Melissa never fails to step up. She really goes above and beyond."
    },
    {
        "nominee": "Vargas,Lisa",
        "unit": "Advancement Operations - IM",
        "quote": "Lisa is a top-notch business analyst who can take your messy process and turn it into something coherent with her toughtful understanding, all with a good sense of humor!"
    },
    {
        "nominee": "Williams,Kearstin",
        "unit": "Development - Education",
        "quote": "Kearstin is a shining example of support in ongoing training and collaborative learning toward our goals. She reflects honestly on establishing innovative best practices. "
    },
    {
        "nominee": "Wilson,Mary Susan",
        "unit": "Development - Planned Giving",
        "quote": "Cristina and Mary Susan are leaders and mentors to those they work with, and their dedication to the UW is inspiring."
    },
    {
        "nominee": "Wise,Dennis",
        "unit": "UMAC",
        "quote": "As a University photographer, Dennis is often the face of UMAC to so many people across the institution — and he treats each one with respect, integrity and care. He is always present on any assignment, whether for a story, an advertisement or studio portrait. "
    },
    {
        "nominee": "Yost,Russell",
        "unit": "Development - CAS",
        "quote": "With his positive attitude and strong connections across campus, Russ is a true team player.  Behind the scenes, he’s always willing to roll up his sleeves and do the less glamorous work alongside his staff to lighten the load."
    },
    {
        "nominee": "Wirig,Angela ",
        "unit": "UMAC",
        "quote": "UW employees get connected with opportunities for professional growth and personal well-being thanks to Angela Wirig."
    },
    {
        "nominee": " Mendoza,Anastasia",
        "unit": "UMAC",
        "quote": "Anastasia Mendoza’s impact is felt across UMAC and far beyond thanks to all that she does to make us a better team and to support the UW’s mission."
    },
    {
        "nominee": " Zhou,Juannan (Sunday)",
        "unit": "Development - Engineering",
        "quote": "Sunday is deeply committed to excellence – whether she is working on a web service ticket or a massive project with thousands of pageviews. She is a bold innovator; never settling for the way that things have been done before, and always looking for better, more accessible solutions that drive our work forward and create impact. Sunday’s work is widely respected across the College and its departments, and she meets every challenge with a positive attitude that inspires her peers. She is truly a superstar."
    },
    {
        "nominee": "Williams,Justin",
        "unit": "ADV OPS",
        "quote": "Justin pushes others to do their best by setting an example with his own work. He is hardworking, dedicated, and he never says no to helping out a colleague. He is always looking for ways to improve  processes in the organization. I appreciate his enthusiasm about new technologies and ideas. \r\r\n"
    },
    {
        "nominee": "Miles,Kelly",
        "unit": "Advancement Operations - PaC",
        "quote": "Kelly has gone above and beyond in her role at PaC with multiple open positions and folks on leave - she has stepped up to the plate and shown how much she cares about the PaC team as well as how much she cares about UA. She has taken charge of huge projects such as sending out merit letters (which are hundreds), recruitment support for the open CAO roles, as well as technological support for all HR records and tasks. She has held her own through it all and always has a smile on her face! "
    }
]