[
 {
   "nominee": "Jones, Lauren",
   "unit": "College of Education",
   "quote": "Lauren Jones embodies the UW values of Integrity, Diversity, Excellence, Collaboration, Innovation, and Respect. Her positive attitude and generous spirit makes her an expert collaborator, amplifying the work of Haring Center for Inclusive Education to create meaningful impact for students, faculty and staff."
 },
 {
   "nominee": "May Oo, Thu Thu ",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Thu Thu is a STAR on the Alumni & Stakeholder Engagement team. While we transitioned to remote work, Thu Thu had to pivot on how we continue to provide great customer service to those who called/emailed the UWAA, while also ensuring that our students transitioned to remote work as well! She is a great representative of a UW employee when she engages with our stakeholders by going above and beyond in her work at the front desk. She problem-solves so that she can take customer service of others’ plate and being quick to jump in on any and all projects and makes us all look polished, compassionate, caring and professional."
 },
 {
   "nominee": "McQuate, Sarah",
   "unit": "UW News",
   "quote": "Sarah pushes to move the UW News teams forward by thinking of new ways to engage researchers across campus. She has the incredible challenge of turning complicated science into stories that engage not only the UW but the public and the media. She is an expert in delivering information in ways that key reporters can understand and work with, placing our experts in countless esteemed publications where they can share their knowledge with the world. She extends impact outside of the team through her leadership of UMAC’s Equity and Inclusion Committee and is consistently a positive force, steadily working with researchers to find the best way to translate their work into a press materials and social media. She is constantly looking for ways to communicate better, often using humor to delight and relax people, and she set up a virtual ’water cooler’ meeting biweekly so that people could touch base on a personal level and maintain the connections we are now finding are so important."
 },
 {
   "nominee": "Mortensen, Kate ",
   "unit": "College of Arts & Sciences",
   "quote": "Kate is an essential asset to the CAS team. She has helped make an adjustment to working remotely, and with her familiarity with Zoom and Microsoft Teams have been a tremendous asset to sustaining momentum. She consistently anticipates what may be complex, virtual interactions with a variety of players, all with a can-do approach and enthusiasm. She goes above and beyond every day, anticipating needs, bringing empathy, collaboration and care to every interactionand simply making every day better.  She is achievement and people oriented with high integrity and curiosity.  She seems to intuitively know how to present information in just the right way to the team, and does the same amount of work as three other humans - at top notch quality, too!  She continues to show up daily with a funny meme or relatable story to check in, and has stayed committed to solution driven thinking and problem solving, so she can provide the team the BEST support imaginable."
 },
 {
   "nominee": "Nilsson, Morgen",
   "unit": "Strategic Communications",
   "quote": "If you have attended, or heard about, one of the large-scale events that have happened over the last six months, there is very good chance that one person has been behind the scenes of it all: Morgen Nilsson. At a time when our websites are in more demand than ever, Morgen Nilsson is there to make sure they work."
 }, 
 {
   "nominee": "Sullivan, Lynn ",
   "unit": "Endowments and Donor Services",
   "quote": "Lynn’s expertise, vision and leadership on the new Gift Agreements process are what make her a Star when it comes to improving systems and transforming the work we do in such positive ways! She skillfully navigates complex relationships and policies while soliciting and being inclusive of feedback from a wide array of stakeholders. She simplifies and streamlines unwieldly processes and does it all while making her colleagues feel valued."
}
]