[
    {
        "nominee": "Acevedo-Barga, Jenny",
        "unit": "Information Management",
        "quote": "Jenny has been fueling innovation at the UW and enabling us to produce better and robust personalized online giving experiences. Her 'can do' attitude is unparalleled!"
    },
    {
        "nominee": "Artiga Monreal, Sylvia",
        "unit": "People and Culture",
        "quote": "Thank you for being a great role model and mentor to so many of us, whether or not you know it. The resources and knowledge that you bring to your work help shape us (me) be better at my job and even more, a better person every day. "
    },
    {
        "nominee": "Berg, Gunnar",
        "unit": "Information Management",
        "quote": "When Gunnar meets a challenge, he does not flinch or give up--he powers through it and considers all possible scenarios to craft a solution that will work. If an issue is found, he willingly listens and figures out a modification, not giving up until it’s resolved."
    },
    {
        "nominee": "Berkshire, Emelina",
        "unit": "Development",
        "quote": "Emelina goes above and beyond to be responsive, supportive and strategic. She is a leader and powerful partner in our evolving work and continued pursuit of excellence! "
    },
    {
        "nominee": "Bhatia, Eileen",
        "unit": "Foster School of Business",
        "quote": "Eileen Bhatia is demonstrating exceptional entrepreneurship, partnership, strategic thinking, commitment to equity and consensus building . She is without a doubt a shining Star in the Foster School and I am one of many grateful she is helping us navigate through these uncertain times"
    },
    {
        "nominee": "Bowers, Danna",
        "unit": "College of the Environment",
        "quote": "Danna is all about building relationships with donors and partners and she does this positively and effectively to create IMPACT. She is highly collaborative and a great team player and always brings a great sense of humor to her work."
    },
    {
        "nominee": "Brookshire, Isaiah",
        "unit": "Regional Advancement",
        "quote": "Isaiah goes above and beyond to provide communications magic to both Regional Advancement and UWAA. He willingly joins projects large and small, and is always happy to help a colleague with a technical problem on the spot. He crafts messages and graphics with just the right tone to engage alumni, donors and friends, collaborates to find solutions to thorny international data issues, rapidly designs branded greeting cards for fundraisers to send out, and ensures event success with his multi-platform expertise and project management chops. He also served as a Subject Matter Expert Liaison, balancing this with his regular responsibilities to support the CRM project."
    },
    {
        "nominee": "Bucholtz, Michelle",
        "unit": "Finance & Administration",
        "quote": "Michelle makes sound judgements, sets clear achievable goals, and helps the team deliver. Michelle has stepped up in the hardest time imaginable to lead both our Finance & Administration team, as well as the People and Culture team. She has done so seamlessly, with grace and with true strength. She has an ability  to focus on both keeping everything running and thinking about long term goals. The teams function harmoniously and that is largely due to her leadership. "
    },
    {
        "nominee": "Carlson, Jordan",
        "unit": "Brand & Creative",
        "quote": "Jordan is the heart and soul of the UMAC creative team — and goes above and beyond her duties as art director every day. Even when we're working remotely, she inspires some of our best work by creating an open, inviting space that sparks creativity and natural collaboration.  "
    },
    {
        "nominee": "Coats, Craig",
        "unit": "Information Management",
        "quote": "Through his commitment, collaborative spirit, integrity and excellence, Craig is powering innovation at UW with a strong data foundation."
    },
    {
        "nominee": "Coleman, Melanie ",
        "unit": "Development Programs",
        "quote": "Melanie is the ultimate team/bridge builder; she is the glue of DevPro. Her efforts have made a more connected  team of colleagues in a group of diverse units that don't always have the opportunity to work together. "
    },
    {
        "nominee": "Dalinkus Kaatz, Jill",
        "unit": "College of Engineering",
        "quote": "Jill is exceptionally professional, kind, organized, and responsive. At the rate Jill responds to emails and moves projects forward, she must have more than two typing hands or she has cloned herself! "
    },
    {
        "nominee": "Dao, Loc",
        "unit": "Information Management",
        "quote": "Calm, creative, caring - thanks for being a positive team member and keeping the lights on for Marketo so that many of us can continue to do our work!"
    },
    {
        "nominee": "DiCasparro, Jenna ",
        "unit": "Endowments and Donor Services",
        "quote": "Jenna was integral in creating the new gift agreements process, which was developed over nine months of collaboration with stakeholders across campus. She makes a special effort to make sure errors are found and resolved as early as possible. This new system will not only save colleagues time and effort, but also creates a more donor-friendly agreement that highlights their incredible impact. Without Jenna, this new process wouldn't be as intuitive and stress-free. She also took the initiative to create online tutorials for the new process, ensuring everyone has access and is up-to-date on how to use the tools."
    },
    {
        "nominee": "Doyle, Stephanie",
        "unit": "Regional Advancement",
        "quote": "Stephanie has been an innovative leader during the pandemic. From guiding and supporting innovative projects to being a champion for what maximum flexibility can look like, she has supported the Regional team and our colleagues on other teams so well."
    },
    {
        "nominee": "Eckart, Kim",
        "unit": "UW News",
        "quote": "Through Kim's leadership, we are all building relationships and increasing our impact with faculty across campus. She is always the first to lend advice, step up and volunteer, making her an invaluable teammate. Her editorial eye is impeccable, while also creating a collaborative process where we are working together to create excellent work."
    },
    {
        "nominee": "Fondaw, Emily ",
        "unit": "Philanthropic Recognition Programs",
        "quote": "Emily's leadership of the Stewardship Network has led to greater collaboration between units, a robust and active network to share ideas and troubleshoot challenges, and has created best practices and practical resources for fundraisers. The value of this work is even more apparent in these challenging times - we are so lucky to have a STAR like Emily leading the way in these efforts! "
    },
    {
        "nominee": "Foss, Jessica",
        "unit": "Finance & Administration",
        "quote": "As the facilities manager for all of Advancement, Jessica Foss has embodied, ‘It Starts with Me’ and innovation while tackling an unprecedented situation. She had just finished a collaborative revitalization of our emergency evacuation program when the pandemic hit. Before we switched to remote work, Jess quickly distributed hand sanitizer and wipes to all units and sent out updates on measures being adopted in the buildings. As UW Medicine experienced dire PPE shortages, she collected our unused hand sanitizer for them. Jess has taken the time to revamp the Facilities webpage with COVID-related, ergonomic, and other resources for employees, while continuing to have vital impact on return to work planning and other critical efforts impacting our safety and well-being."
    },
    {
        "nominee": "Hamilton, Callie ",
        "unit": "Information Management",
        "quote": "Callie is a superstar who is always willing to help, and who's contributions make a huge impact to the overall mission of Advancement. She most recently did a ton of work to get the intranet re-vamped, and looking clean.  Her impact is felt throughout the organization."
    },
    {
        "nominee": "He, Jodie",
        "unit": "Finance & Administration",
        "quote": "Jodie is one of the biggest unsung heroes in Advancement. She quietly goes about her work, always going above and beyond for her team and her colleagues. She has done so for many years now and has grown to be an expert in what she does. She approaches her work with an eye to making it better and better. Jodie will step in with a clarifying question or point that brings the focus on what matters. That is just one of her many talents. "
    },
    {
        "nominee": "Hill, Adam",
        "unit": "Finance & Administration",
        "quote": "Adam is the 'supper team player.' He is consistently helpful to the team as a whole. He goes above and beyond his assigned duties to make sure we are successful as a team."
    },
    {
        "nominee": "Jacobson, Meredith",
        "unit": "Brand & Creative",
        "quote": "Meredith is an invaluable member of the UMAC team, tirelessly ensuring that every single piece of content is accurate, on-brand, and inclusive. Operating under extremely tight timelines, she brings collaboration, excellence, and integrity to everything she touches. She consistently takes the time to offer a personal thank-you, a compliment, or a boost to the person on the receiving end of her email. She is an active part of the Equity & Inclusion Committee and spearheaded our Equitable Language guide. From helping shape the homepage stories to elevating the impact of Admissions copy, Meredith is a significant driver in our production of high-quality and inspiring content."
    },
    {
        "nominee": "Jagannathan, Malavika",
        "unit": "Brand & Creative",
        "quote": "Malavika, our senior copywriter, is an integral member of our team. She joined us last year during a time of transition and uncertainty, and got up to speed incredibly quickly. Whether she is tackling challenging and complex advertising flights or writing beautiful homepage stories, Malavika settles for nothing short of excellence. I have not only been impressed by her writing; I'm glad we have a writer who treats her subjects' stories with such thoughtfulness and respect. Malavika is a smart, convivial member of our team and a strong collaborator with our partner units. We are lucky to have her at the UW."
    },
    {
        "nominee": "Johnson, Falesha",
        "unit": "Foster School of Business",
        "quote": "Falesha consistently brings creativity and follow-through to her partnerships with West Coast / Regional donors. "
    },
    {
        "nominee": "Joseph, Nancy",
        "unit": "College of Arts & Sciences",
        "quote": "Nancy is one of the University of Washington's most outstanding storytellers. The care she takes in profiling students, faculty, alumni and friends of the UW creates opportunities for profound engagement and demonstrates the human-side of UW's incredible impact."
    },
    {
        "nominee": "Kelly, Jacob",
        "unit": "Strategic Communications",
        "quote": "Jacob Kelly connects with as many people on a daily basis as anyone in Advancement, building relationships with our fans and followers across our social media channels."
    },
    {
        "nominee": "Kreptul, Melissa",
        "unit": "Development",
        "quote": "Melissa unfailingly demonstrates a commitment to UW & lives UA values in everything she does. She makes everyone, from long-time colleagues to package delivery folks, feel welcome, cared for, and respected."
    },
    {
        "nominee": "Le, Evie",
        "unit": "Information Management",
        "quote": "Who else care so deeply about the quality of her deliverables that she would pull an all-nighter to ensure perfection? No matter who the audience is on the receiving end of the work – Evie puts the customers first and always ensures that her work is delivered on time and with mere perfection. "
    },
    {
        "nominee": "LeSourd, Michelle",
        "unit": "Regional Advancement",
        "quote": "Michelle leads by example and encourages us to be our better selves in a critical time in our nation's history.  "
    },
    {
        "nominee": "Lessard, Christine ",
        "unit": "Philanthropic Recognition Programs",
        "quote": "Christine's magnetic energy and dedication to excellence make her a joy to work with. She's a focused leader and mentor to many in UA. All of her wonderful qualities combined, make her a star."
    },
    {
        "nominee": "Matthews, Meg",
        "unit": "Strategic Communications",
        "quote": "Meg Matthews' impact is felt across our state and in our own hearts and minds as we seek to create a more inclusive, equitable University and world."
    },
    {
        "nominee": "McGraw , Priscilla",
        "unit": "Annual Philanthropy",
        "quote": "Priscilla is warm, welcoming, friendly and patient. She is reliable and consistent, and undeniably committed to demonstrating the impact of the generosity of our donors in the lives of our students. "
    },
    {
        "nominee": "Mejia , Theresa",
        "unit": "College of Arts & Sciences",
        "quote": "Theresa consistently seeks out opportunities to learn more, create smarter systems, and asks questions that ultimately bring about a better outcome. "
    },
    {
        "nominee": "Moriarty, Ryan ",
        "unit": "UW Tacoma",
        "quote": "Ryan embraced the true spirit of innovation, collaboration and excellence in producing the UW Tacoma campaign impact film. The short film was used to ground our stewardship communications in celebration of the end of the Be Boundless Campaign and the start of the 30th anniversary for the UW Tacoma."
    },
    {
        "nominee": "Nammathao, Napha",
        "unit": "Alumni & Stakeholder Engagement",
        "quote": "Napha is extremely organized, responsible, and knowledgeable. She is someone that her colleagues lean on to get things done and to keep everything flowing smoothly. Thank you Napha for everything you do."
    },
    {
        "nominee": "Page, Heather",
        "unit": "Planned Giving",
        "quote": "Heather is clearly very passionate about UA's work and displays excellence in everything she does. She also consistently displays an extremely positive attitude and is a great pleasure to work with!"
    },
    {
        "nominee": "Peng, Qing",
        "unit": "Finance & Administration",
        "quote": "Qing is an outstanding colleague who's accounting knowledge and her can do attitude has served our team very well."
    },
    {
        "nominee": "Perachio, Elise",
        "unit": "Strategic Communications",
        "quote": "Elise Perachio helps people across Advancement and the University connect with their audiences near and far, keeping them engaged, informed and healthy."
    },
    {
        "nominee": "Peterson, Ande",
        "unit": "UW Medicine",
        "quote": "Ande is a powerhouse collaborator who deep dives into various areas to become an expert, whether that is with copy-writing, peer-to-peer fundraising, giving days, and now nurture streams and sustained giving. She is instrumental to the success of UW Medicine Advancement and has made a lasting impact on our program. "
    },
    {
        "nominee": "Pham, Nina",
        "unit": "Information Management",
        "quote": "It’s hard to imagine all the impact she’s already made within IM in such a short period of time. Can’t wait to see what more she can do in the coming years!"
    },
    {
        "nominee": "Phan, Kathleen",
        "unit": "College of the Environment",
        "quote": "Kathleen is a super star! She has tackled the challenges of this pandemic with grace and a sense of innovation to come up with new ways of doing things. All while juggling two school-aged kids at home. She's incredible!"
    },
    {
        "nominee": "Richmond, Erin",
        "unit": "Regional Advancement",
        "quote": "Erin's expertise, calm demeanor and can do attitude helped our team pivot for at home work success. Erin Richmond leaves no stone unturned when it comes to 'It Starts with Me.' She has worked collaboratively with her supervisor and colleagues to innovate a new dashboard for Regional fundraisers to view and measure team progress.'"
    },
    {
        "nominee": "Rickard, Erin",
        "unit": "College of the Environment",
        "quote": "Erin Rickard is a wonderful, thoughtful, and diligent colleague who is responsive to the needs of each team member, her supervisors, and the organization as a whole. She approaches challenges with grit and determination to ensure the College of the Environment is represented well.  Erin is a super Advancement star! She has stepped up in a big way to ensure that our events this fall are excellent and impactful.'"
    },
    {
        "nominee": "Russell, Dayna",
        "unit": "Information Management",
        "quote": "Dayna expertly assesses, juggles and funnels a ton of moving parts to the right people quickly to move through the testing process.  Her conscientiousness, enthusiasm, desire to do the right thing, and care for the organization and the people we impact make her a natural for this role.  "
    },
    {
        "nominee": "Shelton, Teri",
        "unit": "Strategic Communications",
        "quote": "Teri Shelton has put the power to tell compelling multimedia stories in the hands of communicators and marketers across the UW. The impact Teri Shelton’s work on Storytelling Modules will have is truly great – not just from a storytelling perspective, but from all angles and perspectives.  Her work in creating an easy to use tool for our storytelling efforts has elevated the University and work we all do to support it.'"
    },
    {
        "nominee": "Sherzoi, Mahnaz",
        "unit": "College of Engineering",
        "quote": "Mahnaz is an experienced and capable fundraiser of color who is a great mentor and leader within the College of Engineering and the UW as a whole. Her fortitude and professionalism are an inspiration for those of us lucky to work with her."
    },
    {
        "nominee": "Singh, Jessica",
        "unit": "Brand & Marketing Strategy",
        "quote": "Jessica is the glue that holds UMAC together. She is an extremely empathetic and solutions-oriented teammate and truly a pleasure to work with on any project, and she regularly goes above and beyond to support her colleagues across UA."
    },
    {
        "nominee": "Spratt, Fernanda",
        "unit": "People and Culture",
        "quote": "Fernanda is the definition of bright, hardworking and caring and is single handedly carrying the load of multiple vacancies on the People and Culture team. She has been invaluable as she stepped up and done the most with the least amount of tools. Without her, the People and Culture team would not have been as successful as we are during this unprecedented time."
    },
    {
        "nominee": "Sun, Julie",
        "unit": "School of Social Work",
        "quote": "Julie has gone out of her way to ensure my wellbeing is the best it can be: personally while we all struggle with the global pandemic and state of our country and professionally as she encourages the growth of skills she sees in me to evolve in my position.  "
    },
    {
        "nominee": "Tamiyasu, Mari",
        "unit": "Strategic Communications",
        "quote": "Mari Tamiyasu is helping people across the University of Washington stay informed and healthy during the pandemic."
    },
    {
        "nominee": "Thorpe, Thom",
        "unit": "Strategic Communications",
        "quote": "Through his leadership of - and care for - his team, and through his own skills as a developer, Thom Thorpe is helping the UW and Advancement continue to connect with their audiences during these challenging times."
    },
    {
        "nominee": "Trachtenberg , Maya",
        "unit": "College of Education",
        "quote": "Maya has gone above and beyond this year. Not only has she maintained being an amazing fundraiser but she has worn the hat as event lead, marketing lead and ensures our entire team stays organized during a time where we all struggle to stay on task. She is truly doing the job of three people, and she does it all so well. Plus she's a hilarious and fun colleague that we all lean on for support. "
    },
    {
        "nominee": "Tran, Vuong",
        "unit": "Endowments and Donor Services",
        "quote": "Vuong is the behind the scenes mastermind behind the new gift agreements process. His technical know-how, exceptional problem-solving skills, and good humor in the face of intense projects and tight deadlines make him a STAR colleague!"
    },
    {
        "nominee": "Truong, Melissa",
        "unit": "Finance & Administration",
        "quote": "Melissa is a cornerstone who keeps Advancement humming. From contracts to paying vendors to ad hoc analysis to customer service, she's an unstoppable force who makes Advancement better each and every day."
    },
    {
        "nominee": "Vargas, Lisa",
        "unit": "Information Management",
        "quote": "Lisa is an amazing facilitator--she has the incredible ability to observe, listen, digest, and respond with thoughtful questions or statements that expertly condense what was just discussed.  At the same time, she is incredibly detail-oriented--she leaves no stone unturned by ensuring every possible scenario is addressed.  "
    },
    {
        "nominee": "Vincent, Jenny",
        "unit": "School of Nursing",
        "quote": "Jenny is a true team player and shining example of UA values. She consistently goes above and beyond her role to help advance the School of Nursing's mission."
    },
    {
        "nominee": "Williams, Kearstin",
        "unit": "College of the Environment",
        "quote": "Kearstin demonstrates the best of UA values - she is highly collaborative and has a great sense of integrity in her work. From managing facilities to CRO work to stewardship to discovery, Kearstin has stretched far beyond her advancement coordinator role to become an invaluable member of our team. She has proved her intelligence, flexibility, and willingness to adapt to changing circumstances with good humor and great talent - we could not do our best work without her."
    }
]