[
 {
   "unit": "Adv Ops",
   "nominee": "Ogwude,Isi",
   "quote": "Isi is a leader whose work embodies a steadfast commitment to inclusion, equity and belonging in a field where there is no model or standard for this type of industry-changing work. Illuminating the path in challenging times, she personifies the values and culture we strive for at UA, consistently leading with empathy, passion, care and excellence. "
 },
 {
   "unit": "ASE",
   "nominee": "Goodloe,Amy ",
   "quote": "Amy makes a place as big as UW seem connected and accessible. She leads and collaborates with intention and transparency, bringing together individuals, stakeholders and units together toward a common purpose with enthusiasm, humor and a knack for keeping it real. She is a natural bridge builder and we are a stronger organization because of her dedication and commitment to the UW, Advancement and ASE."
 },
 {
   "unit": "Development - Engineering",
   "nominee": "Schwartz,Erin",
   "quote": "Erin is a committed, inclusive, impactful leader in the College of Engineering. Her work  upholds and advances UA and UW values. She is a collaborative fundraiser who consistently creates impact. She is so passionate about making the world a better place for everyone that she visibly lights up when she talks about the transformative work and research happening at the UW."
 },
 {
   "unit": "Development - Foster",
   "nominee": "Croak,Greg",
   "quote": "Greg is the go-to fundraiser for advice, best practices, encouragement and celebrations of all sizes. His knowledge sharing, experiences and resources helps his colleagues shine and grow in their skills and confidence. "
 },
 {
   "unit": "Development Programs",
   "nominee": ",JEDI Co-Chairs </br></br>Kesia Cisse &amp; Priscilla McGraw Boyer",
   "quote": "These Co-Chairs epitomize the “it starts with me” mindset by providing smart, creative and flexible leadership in a changing DEI landscape within Advancement. They model “our best work is done together” by working effectively with leadership and Collaborative members to build capacity for anti-racist practices in all aspects of fundraising and foster a workplace culture where everyone belongs. "
 },
 {
   "unit": "UMAC",
   "nominee": "Jacobson,Meredith",
   "quote": "Meredith is intentional in her work and relationships. Her care for every written word that comes out of UMAC is evident in the nuanced feedback that comes with every review. Her attention to equity has increased the impact of our written material and visual assets and ensures we're reaching as many people as possible (in the right way) with each publication, email, post or print piece. She is collaborative by nature and I'm always learning something just by being on her team. "
 },
 {
   "unit": "UW Med",
   "nominee": "Reilly,Cathy",
   "quote": "Cathy is a phenomenal advancement professional with a gift of collaborating internally and externally to deliver impact across the WWAMI region. Her vision, leadership style and partnership with central planned giving colleages advance our mission on a daily basis. She approaches her work with the highest level of integrity and respect."
 }
]