[
        {
            "nominee": "The IM Business Analyst Team",
            "unit": "Advancement Operations",
            "quote": "The IM Business Analyst Team (Gunnar Berg, Sarah Maloy and Lisa Vargaas) exudes collaboration and excellence for their work on getting UA ready for Tandem. From their hard work (and many others), it's clear that we will have a top notch product launching in April."
        },
        {
            "nominee": "Nammathao,Napha",
            "unit": "ASE",
            "quote": "Napha is an example of Advancement excellence because of her commitment to advocating for diverse and equitable spaces, fostering community among peers, advocating for her student workers, and being a true team player throughout her many years with ASE. She is equally as professionally talented as she is a deeply authentic and welcoming colleague to all. "
        },
        {
            "nominee": "Naumann,John",
            "unit": "UW Bothell",
            "quote": "John is a powerful champion of UW Bothell students and works tirelessly to bring corporate resources to campus."
        },
        {
            "nominee": "Krueger,Andrew",
            "unit": "Development - Foster School of Business",
            "quote": "Andrew Krueger has worked tirelessly throughout the era of social distancing to close the distances between Foster School alumni, students, faculty, staff, and friends. He opens doors and empowers others to build a better community for us all."
        },
        {
            "nominee": "Rasmussen,Natalie",
            "unit": "Development - UW Medicine",
            "quote": "What you may not know is that Natalie goes above and beyond for colleagues, faculty and donors on an hourly basis. That is not an exaggeration. We rely on Natalie for ALL the nuts and bolts things that make up Donor Relations, but fundraisers also go to Natalie because she is a strategic partner."
        },
        {
            "nominee": "Allen,Rebecca",
            "unit": "Development - UW Medicine",
            "quote": "Rebecca is passionate about DEI and has raised 7 figure gifts to support research to reduce disparities in cancer research and care. It is a pleasure to collaborate with her because she freely shares work and credit in order to raise significant gifts"
        },
        {
            "nominee": "Garrand, Jamie",
            "unit": "UMAC",
            "quote": "Jaime is a highly accountable, dedicated professional who drives everybody around her to be their best. She's also a true team player who knows how to empathize, build bridges and look out for the greater good."
        }
]