[
        {
            "nominee": "Jessica Wang",
            "unit": "UW Medicine",
            "quote": "Jess has been the glue holding our 60+ Medicine Advancement team together this past year, jumping in to help everywhere possible and continually going above and beyond for all of us. Her efforts have boosted the morale of our office, made people feel more valued and supported, and brought levity during a difficult time. She exemplifies UW Advancement's values to an extraordinary degree with her leadership of the UW Gratitude Care Packages Project and her participation in Future State Advisory Committee and shows us all how we can make a positive impact in our community."
        },
        {
            "nominee": "Natalie Rasmussen",
            "unit": "UW Medicine",
            "quote": "Natalie's impressive work is setting the stage for increased future support for UW Medicine. Our donors are fully engaged and updated about the impact of their work thanks in large part to Natalie's leadership. Natalie navigates the stickiest, most complex problems in advancement, untangles the most confusing mysteries, appeases frustrated funders and faculty members, negotiates intricate gift agreements, and manages and executes an astounding volume of impactful and well-written stewardship reports. In addition to Natalie’s super work, she is wicked smart, has a terrific sense of humor, and is humble, kind, compassionate, and generous."
        },
        {
            "nominee": "Lindsay Bailey",
            "unit": "College of Arts & Sciences",
            "quote": "LIndsay keeps our stewardship team on track and productive with her stellar organizational and leadership skills.  She perfectly exemplified an \"It starts with me\" attitude when I asked her for help tracking down the use of a donor's new support fund. And she came back with really meaningful information for our donor. She is a wonderful team leader who daily makes our work and our team better, leading with kindness, humor, and smarts. "
        },
        {
            "nominee": "Ashlie Chandler",
            "unit": "School of Public Health",
            "quote": "Ashlie has shown extraordinary leadership in providing strategy, coordination, team management and production to cover a director-level vacancy on our team.  Her advanced work, above and beyond her job description, has allowed our team to continue our upward momentum and deliver on our collaborative business commitments.  "
        },
        {
            "nominee": "Jere Dennehy",
            "unit": "School of Law",
            "quote": "Jere's persistence, determination, and grace under pressure has been a tremendous asset to her team and the broader law school. She handles confusing and incredibly complex projects with dedication and tact and is the consummate team player who delivers results. She single-handedly collected more than $100K of outstanding fees for the program by diving into the details and figuring out why the program was in deficit and sending (and following up) invoices for the outstanding payments while also renewing sponsors’ pledges for continued program participation. Importantly, she did this without disrupting critical relationships, and thanks to her persistence and analytical skills we now have the funds needed to support student bar preparation fees for the next three years."
        },
        {
            "nominee": "Jaime Garrand",
            "unit": "University Marketing & Communications",
            "quote": "Jamie’s passion for the UW is matched only by her integrity. She models what it means to do the job right for the right reasons. She sets the standard for positive professionalism and has helped lead our team into a new era. The Creative Team would be lost without her instincts, intiative, and critical thinking."
        },
        {
            "nominee": "Christine Lessard",
            "unit": "Philanthropic Recognition Programs",
            "quote": "Christine Lessard is a natural-born leader, and an inspiration to all who know her. I'm proud to know and work with her, and will always look up to her. She  is doing an amazing job leading the new Philanthropic Recognition Programs team into a more equitable and innovative future!"
        },
        {
            "nominee": "Jamie Swenson",
            "unit": "University Marketing & Communications",
            "quote": "Jamie Swenson builds and maintains relationships across Advancement and the University that benefits the entire UMAC team. From admissions ads to the annual Recognition Gala, Jamie is often the lynchpin in many high-profile projects, where he deftly balances his gift as a writer with his deep knowledge of the UW and his unparalleled relationship-building skills. He is a talented writer and natural connector who gets to truly know the people and programs he writes about, and he works hard behind the scenes to make sure our work is top-quality, equitable and full of integrity. And he does it with sensitivity, intelligence and a great sense of humor!"
        },
        {
            "nominee": "Melissa Truong",
            "unit": "Finance and Administration",
            "quote": "Melissa is a driving force for Advancement. She is one of the most key people who keep Advancement going behind the scenes. Her drive and will to be a top contributor while still being humble, cheerful, and collaborative are beyond compare. She is highly capable, intelligent and hard working. She is a role model to many of us. Advancement is so much better due to her impact, she is truly a star!"
        },
        {
            "nominee": "Ellen Whitlock Baker",
            "unit": "Alumni & Stakeholder Engagement",
            "quote": "Ellen is constantly innovating!  She sees needs in the engagement space, gathers a group of experts and partners together to come up with ideas and solutions and then empowers others to take the reins. She is great to work with and I'm always happy with what we accomplish on her group's projects. Not only that, she is a role model as we all try to make the UW and our whole community better and more just. "
        },
        {
            "nominee": "Imad Abi-Saleh",
            "unit": "Finance and Administration",
            "quote": "Imad makes improvements to the F&A processes with his power query expertise & helps his teammates with style! (Big smile on his face)"
        },
        {
            "nominee": "Safiya Bansfield",
            "unit": "College of Arts & Sciences",
            "quote": "Not only is her work impeccable, but the way that she interacts with colleagues is also exemplary."
        },
        {
            "nominee": "Cris Barajas",
            "unit": "University Marketing & Communications",
            "quote": "Cris' empathy makes him a joy to work with and he is constantly elevating how folks throughout the UW view our department. He's a sophisticated marketer that is pushing for us to be even better!"
        },
        {
            "nominee": "Michelle Barnett",
            "unit": "Corporate and Foundation Relations ",
            "quote": "Michelle deserves a whole galaxy of stars for her often thankless role. She performs a host of behind-the-scenes heroics that are invisible to most of us but that benefit us all."
        },
        {
            "nominee": "Kristin Blankenheim",
            "unit": "Prospect Management, Research, & Analytics",
            "quote": "Kristin is a supergiant star! She's a stellar addition to the Central CFR family, our great collaborator in strategy development and prospect research. We're lucky to have her in our galaxy!"
        },
        {
            "nominee": "Nick Bolton",
            "unit": "University Marketing & Communications",
            "quote": "Nick is a nonstop creative workhorse, capable of diving into intellectual social issues with just as much passion as he does with creating mind-blowing visual design and professional video content.  "
        },
        {
            "nominee": "Scott Braswell",
            "unit": "School of Pharmacy",
            "quote": "Scott is the backbone of excellence at the UW School of Pharmacy, leading with kindness as he amplifies the varied voices and experiences across the school, alumni and pharmacy community. "
        },
        {
            "nominee": "Michelle Bucholtz",
            "unit": "Finance and Administration",
            "quote": "Michelle's excellence shows through her support and caring via day to day interactions with the team. She rocks!"
        },
        {
            "nominee": "Tiffany Calverley",
            "unit": "School of Nursing",
            "quote": "Tiffany exemplifies the UA values of \"our best work is done together\" by always putting her colleagues/team first and building a strong UA network. She is the glue that keeps things together and is a STAR colleague."
        },
        {
            "nominee": "Angela Carden",
            "unit": "Corporate and Foundation Relations ",
            "quote": "Angela's star is so twinkly! She is imaginative, intelligent, deeply thoughtful and incredibly resilient in these trying times. Her humor and wit, perhaps best exemplified in the April 1 issue of the Central CFR newsletter, are unmatched. "
        },
        {
            "nominee": "Todd Cleland",
            "unit": "Corporate and Foundation Relations ",
            "quote": "Todd Cleland is a STAR of an asset on the Central CFR team. He exemplifies excellence and innovation in all he does. He is high-energy, high-performing and highly valued in our CFR community."
        },
        {
            "nominee": "Greg Croak",
            "unit": "Foster School of Business",
            "quote": "Greg exudes enthusiasm, humor, and dedication to his craft that has made our team stronger. His work ethic is motivating!"
        },
        {
            "nominee": "Kathleen Crowell",
            "unit": "College of Engineering",
            "quote": "Kathleen's innovative actions and ideas enable fundraisers to demonstrate to donors the life-changing impact their philanthropy is having at UW. She willingly does this for colleagues on her team and any fundraiser who seeks her expertise. "
        },
        {
            "nominee": "Kim Eckstein",
            "unit": "Principal Giving",
            "quote": "Kim routinely goes above and beyond in service to our PGP donors and to her unit-based partners. No request for help is ever denied, and her contributions are outstanding every time. Her unit partners are so much better prepared for effective donor conversations thanks to her expert guidance and relationship skills. Thank you Kim!"
        },
        {
            "nominee": "Michael  Eisenhut",
            "unit": "Foster School of Business",
            "quote": "Michael is a leader that exudes compassion and fosters excellence through his team building and strong passion for our mission."
        },
        {
            "nominee": "Emily Fondaw",
            "unit": "Information Management",
            "quote": "Emily is well trusted throughout University Advancement for being supportive of others and their work, balanced when it comes to collaboration, and generous with sharing her knowledge and expertise."
        },
        {
            "nominee": "Joanna Glickler",
            "unit": "Corporate and Foundation Relations ",
            "quote": "Joanna is the epitome of 'our best work is done together' value.  With her kind and approachable style - she always shares her time, wisdom and good thinking to help build strategies with our most complex donors.  She is invaluable to creating an environment of trust and partnership in our team."
        },
        {
            "nominee": "Caitlin  Grady",
            "unit": "University Marketing & Communications",
            "quote": "Caitlin Grady is an outstanding colleague! She amplifies the voice of UA colleagues by organizing Advancement Connection and writing many of the internal UA communications. She actively researches, writes about and has a beat on UA happenings and is the go-to when we have a message that need to be shared UA-wide. She also engages with as many people as needed to ensure that critical voices are included. "
        },
        {
            "nominee": "Holly Graves",
            "unit": "College of Arts & Sciences",
            "quote": "Despite joining the College of Arts & Sciences Marketing and Communications team during the pandemic, only interacting with the rest of the team virtually, Holly has become an essential team member. She has raised the profile of the College’s social media and grown its audience impressively, in large part thanks to the wit and creativity she brings to her work."
        },
        {
            "nominee": "Callie Hamilton",
            "unit": "Information Management",
            "quote": "Callie is a rock star.  She is always willing to help out with anything you ask from her, and the work she does is always excellent.  She works tirelessly to create messaging that helps keep our staff informed, and provide them easy to digest content about the workings of Advancement.\r\r\n"
        },
        {
            "nominee": "Debby Hanssen",
            "unit": "UW Medicine",
            "quote": "Debby Hanssen goes above and beyond to ensure the smooth running of the UW Medicine Advancement office. She enthusiastically tackles every problem or issue, quickly, strategically, thoughtfully and effectively."
        },
        {
            "nominee": "Susan Hayes-McQueen",
            "unit": "Development Services",
            "quote": "Susan Hayes-McQueen is a luminary among us! She exemplifies COLLABORATION and KINDNESS IN THE EXTREME. Susan regularly makes connections across silos, connecting people to one another and to resources in our midst. And she is the most likely person to offer an affirmation at the very moment you need it most. Not just stars for Susan but moons as well!"
        },
        {
            "nominee": "Jodie He",
            "unit": "Finance and Administration",
            "quote": "Jodie is like a quiet engine keeping many or our critical processes like payroll working like clockwork behind the scenes. She is super bright, humble and very much the team player! It is a joy to work with Jodie and to learn from her!"
        },
        {
            "nominee": "Elly Henriksen",
            "unit": "Information Management",
            "quote": "Elly has done incredible work in implementing a new LMS for Advancement to be able to utilize in the coming months, and has truly gone above and beyond in her role in TLT. Her collaboration skills and intelligence in the field are unmatched!"
        },
        {
            "nominee": "Adam Hill",
            "unit": "Finance and Administration",
            "quote": "I have been fortunate to work closely with Adam and have benefited greatly as a result. His experience stretches across virtually all of UA’s financial tasks. He always makes time to support anyone on our team who has a question or is in need of understanding a particular process. He is an invaluable repository of knowledge. If you have a finance question he has the answer."
        },
        {
            "nominee": "Kenton Ho",
            "unit": "Information Management",
            "quote": "Kenton is a joy to work with—he takes on challenges with confidence, curiosity and persistence.  His enthusiasm and incredible ability to easily absorb new concepts make him an invaluable asset for our team and the CRM project.  "
        },
        {
            "nominee": "Lauren Honaker",
            "unit": "Corporate and Foundation Relations ",
            "quote": "Lauren deserves so many stars for the leadership she contributes as part of Central CFR. She is an authentic and credible voice in her field, a crackerjack strategist, a ready resource for faculty and colleagues across campus, and a complete delight to work with!"
        },
        {
            "nominee": "David Houk",
            "unit": "UW Medicine",
            "quote": "Who you gonna call? David Houk! Whenever we have a computer or tech issue, we first contact David. No matter how frazzled we may be, David is always there to calmly solve our problem."
        },
        {
            "nominee": "Nicky Howard",
            "unit": "Alumni & Stakeholder Engagement",
            "quote": "Nicky serves volunteers!  She's constantly going the extra mile for our 50 year reunion volunteers, and has expertly managed the relationships with our Husky volunteers across the nation.  Her volunteers always leave their terms with profound experiences connecting back to their Husky roots. "
        },
        {
            "nominee": "Alex Ichinoe",
            "unit": "Information Management",
            "quote": "Alex is a true team collaborator! I appreciate his dedication, innovation, and willingness to go the extra mile to ensure that anyone who comes to the reporting team will be heard and get what they need.  We can be the best at what we do because of staff members like Alex!  "
        },
        {
            "nominee": "Meredith Jacobson",
            "unit": "University Marketing & Communications",
            "quote": "With impeccable editing skills and a deep commitment to Diversity Equity & Inclusion, Meredith elevates every bit of work we do--and along the way, teaches us to be better, more inclusive communicators."
        },
        {
            "nominee": "Malavika Jagannathan",
            "unit": "University Marketing & Communications",
            "quote": "Malavika is not only a talented writer but a first-rate researcher and strong advocate for equity, not only in the work we produce but also in the ways that we work. UA is better off for her presence; she lives the UA tenets every day!"
        },
        {
            "nominee": "Nancy Joseph",
            "unit": "College of Arts & Sciences",
            "quote": "When it comes to telling compelling, thoughtful and impactful stories, Nancy is *the* go-to person at the UW. Her stories weave together the importance of philanthropy, community, teaching, research and civic engagement to advance our goals around fundraising, student recruitment and general visibility for the College of Arts and Sciences."
        },
        {
            "nominee": "Erin Kenney",
            "unit": "Information School",
            "quote": "New to UW, Erin demonstrates how an employee can become a valued member of the team while working remotely and succeed despite the obstacles the pandemic has presented in how we do our work. "
        },
        {
            "nominee": "Tamara LaFrance",
            "unit": "Corporate and Foundation Relations ",
            "quote": "Tami's star shines brightly. She is collegial, communicative, collaborative and kinder than heck. Her commitment and initiative in helping support fundraising in DEI spaces is but one highlight of a year in which Tami has shown adaptability and resilience."
        },
        {
            "nominee": "Nick  Lam",
            "unit": "Information Management",
            "quote": "Nick is calm and very level-headed - I appreciate this most about him because I know I can depend on him and turn to him for clarity under any tense situation. He is someone who anyone can easily collaborate with because he’s calm and open-minded, inspiring trust from those around him. He is a quiet leader who makes a big impact.  "
        },
        {
            "nominee": "Sophie Lee",
            "unit": "Regional Advancement",
            "quote": "Sophie is a global ambassador for the UW who fills roles above and beyond her job description on a daily basis. "
        },
        {
            "nominee": "Alice Lee",
            "unit": "University Marketing & Communications",
            "quote": "As the manager of the UW Visitors Center and a member of the UMAC social media team, Alice works with and represents the student community. She has also started important discussions on anti-Asian attacks, which wil. impact how we craft future messages about communities within the UW."
        },
        {
            "nominee": "Michelle Ma",
            "unit": "University Marketing & Communications",
            "quote": "It takes a special person to pivot to pandemic remote work and seamlessly keep a team on track. Michelle Ma has earned the respect of her staff and the entire UW News team for her integrity and level-headed leadership as the associate director of the UW News.\r\r\n"
        },
        {
            "nominee": "Meg Matthews",
            "unit": "University Marketing & Communications",
            "quote": "Throughout this pandemic, Meg has poured herself into creating content to help keep our many constituents informed and up to date on decisions the UW is making to protect their well-being and help them prevent the spread of COVID-19. She's also deeply devoted to Advancement's and UMAC's diversity, equity and inclusion (DEI) efforts, including helping lead UMAC's DEI committee and developing programming to help us learn as an organization."
        },
        {
            "nominee": "Sean McGinnis",
            "unit": "Alumni & Stakeholder Engagement",
            "quote": "Sean has risked his health to go into the UW Tower to make sure our UW community continues to feel supported and engaged through their UWAA membership. Not only does he keep our work going, but he does it with a positive attitude that is contagious to the team."
        },
        {
            "nominee": "Michelle Meade",
            "unit": "UW Medicine",
            "quote": "Michelle provides amazing customer service in her work with gift acceptance and thanking. She demonstrates great judgement with complex gift issues and makes appropriate recommendations for thanking and stewardship. "
        },
        {
            "nominee": "Elizar  Mercado",
            "unit": "School of Public Health",
            "quote": "Elizar Mercado is truly one of our unsung heroes in public health – especially during the COVID-19 pandemic. As a multimedia specialist, he is integral to the design and branding of the SPH communications, magazine and website, that receive kudos from UW Marketing and Communications. A can-do attitude, combined with collaborative skills and innovative ideas, are huge assets for the school. Careful thought to diversity, inclusion and accessibility is a hallmark of his meticulous work. The array of beautiful graphics, photos, artistic layouts, and social media posts – flawlessly crafted by Elizar – are helping us to proudly celebrate our 50th Anniversary. "
        },
        {
            "nominee": "Hayley Miller",
            "unit": "College of Arts & Sciences",
            "quote": "Hayley consistently goes above and beyond to steward her donors AND her peers. She is committed to DEI efforts in the College of Arts and Sciences, innovates her processes for maintaining solid relationships with donors, and is a general beam of light during the difficult period of working from home. She is an asset to our team!"
        },
        {
            "nominee": "Linnea Nasman",
            "unit": "UW Medicine",
            "quote": "Linnea went above and beyond to orchestrate a complex gratitude campaign for UW Medicine staff and caregivers through in-kind donated snacks and self-care items. She created an exciting experience for her colleagues at contribute and participate in giving back to UW employees leading the COVID-19 response. "
        },
        {
            "nominee": "Katelyn Ng",
            "unit": "College of Arts & Sciences",
            "quote": "Katelyn makes our Advancement Services team's work better through her tireless assistance with a wide array of projects. She is always enthusiastic, never says no to a new project, is always learning, and carries a full load of classes. We hope she never leaves!"
        },
        {
            "nominee": "Julie Ngo",
            "unit": "Information Management",
            "quote": "Julie has shown her impact as project manager for the CRM and as creator of the International Women's Day event, an event that has become a central place to have conversations about equity and diversity. "
        },
        {
            "nominee": "Michele Norris",
            "unit": "Information School",
            "quote": "Michele has proven to be a stellar supervisor throughout the shifting landscape that COVID has forced us to walk through. She spends energy at every team meeting to check in with each of her team members and interjects fun ways for us to engage with one another. During most of 2020 Michele was the only major gift fundraiser on the team and still brought in strong philanthropic support for the iSchool, while keeping the team motivated and excited about WFH. Time and time again Michele has advocated for her team to make sure they have all the resources and support for them to be successful. "
        },
        {
            "nominee": "Qing Peng",
            "unit": "Finance and Administration",
            "quote": "My friend and colleague Qing has a wonderfully positive attitude that she brings to our work. She is innovative and team oriented. I have been privileged to work with her on a number of reporting projects and have experienced firsthand her many qualities. She is smart, humble and very much a team player always responsive and supportive. She spreads infectious joy around the F&A team!"
        },
        {
            "nominee": "Elise Perachio",
            "unit": "University Marketing & Communications",
            "quote": "Elise has gone above and beyond her job duties in her support of our team's Marketo emails, which fully embodies our UA values of \"it starts with me\" and \"we create impact.\" Stakeholders have continued to hear about the College of Education's impact -- in a period of significant staff transitions -- because of Elise. "
        },
        {
            "nominee": "James  Perez",
            "unit": "Information School",
            "quote": "One of the main reasons behind James' success in fundraising for the CIP is he really believes in the shared values of strengthening democracy and combatting disinformation. His commitment and his authenticity are apparent to donors. "
        },
        {
            "nominee": "Charlotte Peters",
            "unit": "Gift Services",
            "quote": "As Co-Project Manager of the UW Gratitude Care Packages Project, Charlotte has been a driving force behind our volunteer effort to show our appreciation for our colleagues at UW Medicine. "
        },
        {
            "nominee": "Dan  Peterson",
            "unit": "Development",
            "quote": "Dan is the epitome of excellence. His ability to cultivate strong relationships with his donors and achieve their philanthropic goals in all areas of Foster makes everyone around him work harder. He matches that with his support of his colleagues. Dan is always quick to jump on a call and talk you through a strategy, offer great feedback, and bring his own insight to the conversation. He is always forward-thinking, a team player, and an all-around role model."
        },
        {
            "nominee": "Marissa Rowell",
            "unit": "College of Arts & Sciences",
            "quote": "Marissa is a skilled designer with creative ideas, who raises every project she touches to another level thanks to her talents.  This year, as she has taken on another role -- heading diversity, equity, and inclusion efforts for College of Arts & Sciences Advancement -- she has shown grace and understanding, and done a wonderful job making others feel included in the process. \r\r\n"
        },
        {
            "nominee": "Garrett Schultz",
            "unit": "Foster School of Business",
            "quote": "Garrett has stepped up to the challenge and immersed himself in bringing our entire team together during a time that lacks connection. He has played a vital role in planning event parties via Zoom that has given us the sense of community that we need. He truly is hardworking and kind in everything he does from working with a donor to building strong relationships with his teammates. "
        },
        {
            "nominee": "Erin Schwartz",
            "unit": "College of Engineering",
            "quote": "Erin is inclusive, thoughtful, respectful, and has a knack for aligning desired outcomes with reality. She strives for excellence and inspires her team to do the same. It is a pleasure to innovate with her! "
        },
        {
            "nominee": "Danielle Shubat",
            "unit": "School of Pharmacy",
            "quote": "Danielle is a skilled, savvy and forward thinking super-talent at our School. Compassionate, focused and multi-talented, she works tirelessly, and always puts the School of Pharmacy's success before her own. "
        },
        {
            "nominee": "Carolyn Smith",
            "unit": "Corporate and Foundation Relations ",
            "quote": "We have a star in our midst! No one exemplifies \"above and beyond\" more than Central CFR's most excellent Carolyn Smith. Not only is Carolyn the glue that binds our team, but she helps to create, and then enables and supports, our team's aspirations large and small. "
        },
        {
            "nominee": "An Tran",
            "unit": "Regional Advancement",
            "quote": "An Tran is a consistent and solid 'value add'. Every conversation, interaction, meeting, etc. with An is, without fail, a productive use of time. "
        },
        {
            "nominee": "Lisa Vargas",
            "unit": "Information Management",
            "quote": "Without Lisa there is no bridge between the business needs and good ideas, and the developers who build the solutions we need to take our Advancement work to the next level of technology. Without Lisa business needs and good ideas are spread out across the organization instead of being brought together to see where they intersect. Without Lisa good ideas and business needs are just that, her work is making sure they aren't lost of forgotten. Her ability to transform conversations into action items and communicate them back in a way people can understand is truly impressive. All this in the middle of a pandemic that upended how we work and communicate. Without Lisa, our good ideas for improving Advancement are just that. Lisa takes our ideas and makes them a reality. "
        },
        {
            "nominee": "Tara  Warming",
            "unit": "Alumni & Stakeholder Engagement",
            "quote": "Undeterred, Tara shifted the focus of INFO 20 in '20 from an in-person celebration to a sequence of online messaging and virtual events that managed to perfectly capture the innovative spirit of our Informatics program and its alumni. "
        },
        {
            "nominee": "Taylor White",
            "unit": "Alumni & Stakeholder Engagement",
            "quote": "Taylor is a superhero in terms of collaboration and innovation.  She is an anchor on our staff and takes every request in stride.  Taylor is STAR and we appreciate all that she does!"
        },
        {
            "nominee": "Justin  Williams",
            "unit": "Information Management",
            "quote": "Justin is the kind of person who will find a better, more efficient way to any processes that you are running, if you ask him for help. He is thoughtful, smart, and creative, and I am lucky to be working and learning alongside him.  He will never say no to helping anyone, even when he has a dozen priorities on his shoulder."
        },
        {
            "nominee": "Russ Yost",
            "unit": "College of Arts & Sciences",
            "quote": "In addition to his successful efforts to reach out to prospective students and promote the UW's liberal arts offerings, Russ is a wonderful leader and advocate for his staff. His generosity of spirit and encouragement have made this challenging time more manageable for his entire team."
        },
        {
            "nominee": "Lauren Zondag",
            "unit": "College of Arts & Sciences",
            "quote": "Lauren's earnest and thoughtful approach to her work has earned her trust among her colleagues on the team and across Advancement. She understands that relationships and partnerships are the key to creating impact and achieving shared success."
        }
    ]