[
 {
   "nominee": "Sonntag, Erin ",
   "unit": "UW Medicine: Campaign",
   "quote": "Erin Sontag is a powerhouse in the UWM Donor Relations team, bringing her formidable design and editorial talents to raise the specter of stewardship impact reports for the Institute for Protein Design.  Her drive for excellence and innovation have been critical in stewarding the IPD's most generous leadership donors. True to her home department and core responsibilities--Erin's constant lens is focused on our donors, and how we might deepen--authentically--our relationship with them."
 },
 {
   "nominee": "Thompson, Chris",
   "unit": "UW Medicine: Development Office",
   "quote": "Chris has become a respected leader at UW Medicine, and has greatly increased the impact and influence of our CFR team. He has done this with great humility and thoughtfulness, ensuring that all partners and teammates feel valued and empowered. His ability to very swiftly translate complex scientific concepts into layperson terms, was central to our ability to quickly stand up a very effective fundraising effort and churn out excellent, compelling proposals for our top philanthropists in our community.  He is the type of high performer who works around the clock to get the important work done on time, and then asks what else he can do to help."
 },
 {
   "nominee": "Hill, Adam",
   "unit": "Finance & Administration",
   "quote": "Adam exemplifies all the values of UA culture and does so with humility and grace. He tackles ever project with gusto, even if its not normally in his job, and always brings the very best ideas and questions for how to make things better. He works through many different situations that are often last minute and complicated with complete grace and positivity."
 },
 {
   "nominee": "Chien, Gloria",
   "unit": "UW Medicine: Campaign",
   "quote": "While it has always been readily apparent that Gloria Chien is a consummate professional, my experiences in working alongside her has demonstrated her dedication to excellence, collaboration, and integrity. She is unendingly kind and patient with faculty and donors alike, and constantly seeks to find solutions for them. Gloria is the true embodiment of UW Advancement values, approaching her work every day with positivity and service to her colleagues. We are lucky to have her."
 },
 {
   "nominee": "Dunlap, Wendelin",
   "unit": "College of Arts & Sciences",
   "quote": "Wendelin is a joyful endeavoring spirit who patiently works to ensure that no detail is overlooked and that the people she supports feel heard. Her curious and persistent work has led to shifts in how we do our work that make us both more efficient and better prepared to serve our community. Wendelin’s pursue for excellence is inspiring, she not only produces high quality digital communications but she also continuously motivates others to follow best practices."
 },
 {
   "nominee": "Giacomini, Cara",
   "unit": "Annual Philanthropy",
   "quote": "Cara is leading her team to be successful by developing a more insightful data-driven approach to the Annual Philanthropy team and leading efforts in developing effective analytical tools that will inform the way we work now and well into the future. She is a great example that “our best work is done together”."
 },
 {
   "nominee": "Henriksen, Elly",
   "unit": "Information Management",
   "quote": "Elly works tirelessly to increase her knowledge on our current products and the products we could be using simply to make our user's experience better. She has worked Above & Beyond to survey users across campus, hear their voice and then communicate those needs to Central so we all can receive the proper training during this new normal. It embodies 3.0 Framework by being forward thinking and UA/UW values by promoting Innovation and Collaboration while doing our best work together!"
 },
 {
   "nominee": "Mortensen, Kate",
   "unit": "College of Arts & Sciences",
   "quote": "Kate is the perfect combination of professional and fun. Working with is ALWAYS a pleasure and pushes me to be better. I am a better person for knowing Kate. She joined the College of Arts & Sciences team and immediately influenced how we work as a cohesive, high-achieving team. She has a can-do attitude that bowls you over with enthusiasm."
 },
 {
   "nominee": "Ngo, Julie",
   "unit": "Information Management",
   "quote": "The impact of Julie Ngo's work will be felt in UA for decades. Her fingerprints are on every project, her enthusiasm keeps the team going in even the most frustrating moments and we would arguably be lost without her. Julie is the powerhouse that's making the whole CRM migration tick."
 },
 {
   "nominee": "Anderson, James",
   "unit": "College of the Environment",
   "quote": "Though James has been with our team for a short time, his knowledge of university systems is incredible and he’s always looking for ways to leverage the impact of Environment programming through cross-campus Advancement partnerships. He is a wonderful asset to our team and we cannot wait to see what he accomplishes in his new role!"
 },
 {
   "nominee": "Arviso, Dana",
   "unit": "College of Education",
   "quote": "Dana Arviso calmly, efficiently, industriously, impactfully and collaboratively envisions, secures funding for, and implements the College of Education's United:Ed initiative, which aligns innovative research with community needs and ensures that diverse community partners and doctoral students benefit equitably and soon from that research."
 },
 {
   "nominee": "Bailey, Lindsay",
   "unit": "College of Arts & Sciences",
   "quote": "Lindsay goes way above and beyond every day to put the needs of others before her own, accomplishes all her goals on time, while moving our strategic vision forward, and meeting questions and challenges with wisdom. She leads by example, celebrating the accomplishments of others, and puts forward our team’s strengths. Lindsay’s own strengths embrace the smallest detail and the broadest vision, while inviting everyone else along with her."
 },
 {
   "nominee": "Barrera, Laura",
   "unit": "College of Built Environments",
   "quote": "Laura is a learner who really unites her colleagues! Her work shows that our best work is done together. If you need to get things done right and throughly...COUNT ON LAURA!"
 },
 {
   "nominee": "Berg, Krista",
   "unit": "Prospect Management, Research, & Analytics",
   "quote": "Krista's leadership of the DEI book group has introduced an important outlet for personal and professional growth, and her consistency in making it happen is a welcome chance each quarter to add some meaningful socializing to my week. Krista finds myriad ways to be involved and inspire internal and external partners."
 },
 {
   "nominee": "Brookshire, Isaiah",
   "unit": "Regional Advancement",
   "quote": "As the University has been coordinating its response to the COVID-19 crisis, Isaiah Brookshire has gone above and beyond. He asked how he could help, and has been sharing his time with our UMAC colleague to help relieve some of the overwhelming communications pressure. He goes \"above and beyond\" to cordially and efficiently provide communications magic to both Regional Advancement and UWAA. Just when you think you are aware of everything Isaiah has to offer, another facet of his talent is revealed."
 },
 {
   "nominee": "Calverley, Tiffany",
   "unit": "School of Nursing",
   "quote": "Tiffany is a great relationship builder, making her a dependable friend and excellent colleague to many. She is the epitome of \"our best work is done together\"!"
 },
 {
   "nominee": "Doran, Jill",
   "unit": "College of Arts & Sciences",
   "quote": "Jill has built an Advancement Services team that serves the needs of our College, our fundraising team, and the UA mission. This team works hard to serve internal partners, while honoring our donors and the impact they make."
 },
 {
   "nominee": "Forster, Claire",
   "unit": "School of Pharmacy",
   "quote": "An undaunted leader who sees the best in all whom she meets, Claire embodies the culture of excellence created at UA. In all teams she leads and joins, Claire lifts everyone up to do their best work. In addition to bringing an exemplary level of dedication and excellence to her work as a leader, Claire exudes warmth, humor and humanity – something that transcends the day-to-day obligations of the workplace."
 },
 {
   "nominee": "Gourley, Rebecca ",
   "unit": "UW News",
   "quote": "Rebecca performed two jobs - the editorial assistant position and digital content producer position - which was especially demanding when UW News was on the front lines of the UW's response to the coronavirus epidemic.  She is a great cross-team collaborator who has gained a reputation for excellent work with sensitivity to the diversity of our UW News audience within and outside the university community. She is increasing the reach of UW News, and she is a supportive and uniting force."
 },
 {
   "nominee": "Hamilton, Callie",
   "unit": "Information Management",
   "quote": "Callie's communication skills make even the driest project burst with energy and fun. She is a sorceress with words and her commitment to the voice of the constituent ensure we always have their needs top of mind. I understand this award should go to someone that goes above and beyond, demonstrates our values, and has a positive impact in our community. Without any hesitation and with much pride I cannot think of another person that embodies these criteria more than Callie Hamilton."
 },
 {
   "nominee": "Ingram, Megan",
   "unit": "School of Public Health",
   "quote": "Megan cares deeply for our work, but not as much as she cares for helping people. She's a convener of ideas, colleagues and impact that makes all around her better.  She connects personally and is always willing to spend time sharing context in order for someone to do the best work possible."
 },
 {
   "nominee": "Kreptul, Melissa ",
   "unit": "Office of the Senior Vice President",
   "quote": "When Melissa stepped in to help our ASA team - we heaved a collective sigh of relief! Her skills, knowledge of the UW and trustworthy and engaging approach to our work had an immediate impact on our performance and well being. Melissa is caring and dedicated - we are so lucky to have her!"
 },
 {
   "nominee": "Lee, Mike ",
   "unit": "College of Arts & Sciences",
   "quote": "Mike is very smart and has high standard of his work. He is the ultimate team player - generous in sharing his own knowledge, and eager to learn from his colleagues!"
 },
 {
   "nominee": "Maresh, Jannah",
   "unit": "Academic Student Affairs",
   "quote": "The UW's role in the lives of so many extended families is crucial. We care for students on many of their first journeys away from home. Jannah's work to communicate and care for the families left behind makes such a difference in their health and safety-- extending the Husky family to so many in the state, nation and the world. Jannah helps all of us build a welcoming Husky community for parents and families -our #1 partners in student success, retention and securing a top notch incoming class. Thank you Jannah!"
 },
 {
   "nominee": "McFaul, Joey ",
   "unit": "Regional Advancement",
   "quote": "Joey is an integral part of Regional Advancement's development work. Her positive attitude, strong organizational skills, and problem solving abilities keep our team running smoothly. She brings intention and diligence to the workplace. She makes our office a better place to work and is such a terrific colleague!"
 },
 {
   "nominee": "Page, Heather",
   "unit": "Planned Giving",
   "quote": "Heather is a bright star among the many at UW Advancement. In partnering with her at my unit, Heather’s reach has let me exceed my grasp. Her boundless work helps make Planned Giving a \"power\" team at the UW."
 },
 {
   "nominee": "Rickard, Erin",
   "unit": "College of the Environment",
   "quote": "Erin knocked out a deep dive in auditing our fiscal budgets with a level of precision and detail not previously achieved, creating a stable foundation to make clear strategic budgetary decisions going forward. Her sunny and sassy disposition has sparked life into the morale of the College of the Environment Advancement team, creating a joyful place for all of us to work.  She is a shining star to guide us forward in these uncertain times."
 },
 {
   "nominee": "Scott, Amy ",
   "unit": "Planned Giving",
   "quote": "During a time of duress, Gift Services has made it possible for donors to keep on giving and for University units to benefit from philanthropy. Her boundless work helps make Planned Giving a \"power\" team at the UW."
 },
 {
   "nominee": "Seevers, Melinda",
   "unit": "College of the Environment",
   "quote": "Melinda represents the best of UA Values - she is an incredible team leader and exemplifies that our best work is done together. Her consistent and transparent leadership has been essential in these difficult times, and she is a star that I plot my course to. She always emphasizes that our best work is done together and encourages us to think about our impact in everything we do. With her leadership our College of the Environment Advancement team will come out of this stronger than ever."
 },
 {
   "nominee": "Shannon, Kelsea",
   "unit": "School of Public Health",
   "quote": "Kelsea Shannon is an indispensable member of our SPH team whose grace, intelligence and generosity helps us produce our best work with an eye towards innovation, a spirit of giving and a relentless drive for quality. I value the way I can totally trust her to catch loose ends or important details and the way she's always willing to critically think through and recommend next steps."
 },
 {
   "nominee": "Sullivan, Lynn",
   "unit": "Donor Relations",
   "quote": "Lynn has been the point person for Stewardship and Donor Relations for a long time, and her leadership and great ideas, as well as collaboration, make everyone's jobs smoother, easier, and better. She answers questions and solves problems no one else can (literally). She is a superstar!"
 },
 {
   "nominee": "The Finance & Administration Team",
   "unit": "Advancement Operations",
   "quote": "The finance and administration team members, my colleagues, take UW’s and UA’s values to heart. Ours is a highly productive and innovative team. They are also fun to work with. United with positive attitude, we can achieve greatness in Advancement 3.0!"
 },
 {
   "nominee": "The UW Medicine Team",
   "unit": "UW Medicine",
   "quote": "This team rallied around the docs, nurses, clinicians, patients, community, and more during the COVID-19 pandemic. It was inspiring to see them at the head of the nationwide effort and to know that they were helping to make things better. We are grateful to live in a world where they make a difference and are proud to call them our colleagues."
 },
 {
   "nominee": "Truong, Melissa",
   "unit": "Finance & Administration",
   "quote": "Melissa is the definition of smart, hardworking, and kind. Work with a cheerful attitude is a cherry on the top of ice cream or sunshine in a rainy season! She is one of the glue people who drives Advancement forward in so many ways."
 },
 {
   "nominee": "Vincent, Jenny",
   "unit": "School of Nursing",
   "quote": "She is an unstoppable force for the School of Nursing. The term \"other duties as assigned\" was never more relevant to a team than what SON Advancement accomplished this year. Jenny is hardworking, dedicated, driven, caring, grace under pressure, and highly collaborative. She is an absolute star!"
 },
 {
   "nominee": "Albertson, Matthew ",
   "unit": "KUOW",
   "quote": "Matt excels in supporting KUOW's mission and vision and lives out our values at all times. He is a enjoyable collaborator, thoughtful leader and has (sometimes) exhausting attention to detail. He puts donors first and advocates on their behalf. He is curious and has courage to take on issues at all levels of the organization. He acts in service to KUOW and the University of Washington and proudly exudes his love for both at the many community events he attends. He's great, go Matt! "
 },
 {
   "nominee": "Altman, Beth ",
   "unit": "Information Management",
   "quote": "Beth created the new Development Leadership Dashboard that helps CAOs keep their finger on the pulse of their unit's progress toward fundraising goals."
 },
 {
   "nominee": "Anderson, Leslie",
   "unit": "Principal Giving",
   "quote": "From the Office of the President, to all schools and colleges and campuses, from administrative counterparts to faculty and deans, Leslie has brought her expertise, knowledge and practical solutions to our sometimes complicated world. Leslie has been an important UA STAR for 20 years of dedicated commitment."
 },
 {
   "nominee": "Anderson, Rachel",
   "unit": "College of the Environment",
   "quote": "Rachel continues to impress us with her ability to develop deep and meaningful relationships with donors, her quality stewardship, time management, and fundraising skillset. The relationships she has built with her donors and our team are everlasting, and the UA team and university are better off for it. "
 },
 {
   "nominee": "Arts and Sciences MarComm Team",
   "unit": "College of Arts & Sciences",
   "quote": "The team embraces integrated advancement at the highest levels. They are engage with future Huskies from admissions to acceptance, they communicate with students throughout their UW journey and then provide compelling content for alumni."
 },
 {
   "nominee": "Balta, Victor",
   "unit": "UW News",
   "quote": "The UW has been everywhere in the national news during this crisis, showing that we are leaders. The conduit to make this strategic and successful lies in the work of Victor Balta and the news team. I am so proud to be part of UW right now, and recognize that Victor helped make that even more apparent! "
 },
 {
   "nominee": "Blankenheim, Kristin ",
   "unit": "Prospect Management, Research, & Analytics",
   "quote": "Kristin is such a great partner -- she thinks creatively and outside the box in order to accomplish big ideas. She is willing to go the extra mile to get something done and when she does--it is thorough! And she is always so positive and fun to work with. I leave meetings with her smiling! I'm so grateful to have her as a colleague. "
 },
 {
   "nominee": "Blomster, John",
   "unit": "School of Law",
   "quote": "John approaches every assignment with an infectious enthusiasm that inspires those around him. Every story gets the loving care and attention it deserves. Through his work, UW Law is truly able to articulate those qualities that makes our school and university unique."
 },
 {
   "nominee": "Bowers, Andrea",
   "unit": "Foster School of Business",
   "quote": "As the mastermind behind the MBA Rankings Calculator, Andrea has produced data driven expert analysis of several key rankings to strategically develop, align and amplify key Foster messages while managing the evolving expectations of program directors, who are trying to keep enrollment on track amid global uncertainty. In her spare time, Andrea organizes informal team-building activities like the running group, bike outings, and rallies a Foster presence for Whole U challenges and sessions. She's clearly a wonderful steward of Foster and the Foster community, and we are a better team because of Andrea - a dedicated worker and a great connector who excels at rallying people together no matter the cause."
 },
 {
   "nominee": "Bowers, Danna",
   "unit": "College of the Environment",
   "quote": "Danna has reinvigorated our CFR program and will be making many dynamic contributions. The groundwork she is laying with donors now will have lasting impact in the years to come. "
 },
 {
   "nominee": "Boyles Ilk, Eryn",
   "unit": "Regional Advancement",
   "quote": "Eryn is the epitome of University Advancement's values. She is a terrific colleague who takes initiative to get the job done, prioritizes collaboration with all, and is a trusted liaison for many donors whose philanthropy is creating significant impact within our university community. "
 },
 {
   "nominee": "Brown, Julie",
   "unit": "Advancement Operations",
   "quote": "Julie Brown's leadership is louder than a packed basketball game!"
 },
 {
   "nominee": "Burwell, Clint ",
   "unit": "UW Medicine: Campaign",
   "quote": "Clint is the trusted, strategic leader that you wait your whole entire career to be able to work for. He'll empower you to use your strengths and instincts to find and maintain success, while helping you grow as a leader."
 },
 {
   "nominee": "Campbell, Amanda ",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Amanda's innovation expanded a signature UWAA program, while creating new student leadership opportunities along the way."
 },
 {
   "nominee": "Carman, Evan ",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Evan paves the way for our team to be successful in the work we do!"
 },
 {
   "nominee": "Cato, Barron",
   "unit": "Annual Philanthropy",
   "quote": "Barron is a diligent and thoughtful leader who brings great insight to any project he touches. He spends the time to dig deep into his projects, understanding the complexities of the questions at hand and developing new ways of tracking all aspects of University Advancement's work'from engagement to fundraising to forecasting revenue. "
 },
 {
   "nominee": "Chapman, Allison ",
   "unit": "Prospect Management, Research, & Analytics",
   "quote": "Allison is a powerhouse in preparing analysis for our team to communicate to fundraisers, helping them focus on just the right prospect actions."
 },
 {
   "nominee": "Charleston, Erica",
   "unit": "Strategic Communications",
   "quote": "She has worked Above & Beyond to survey users across campus, hear their voice and then communicate those needs to Central so we all can enjoy an improved implementation. This has a very broad-reaching impact since it could impact over 300 employees. It embodies 3.0 Framework by being forward thinking and UA/UW values by promoting Innovation and Collaboration while doing our best work together!"
 },
 {
   "nominee": "Chilcote, Karen ",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Karen Chilcote is a marketing and communications rock star with a creative and strategic mind that brings both opportunities and successful outcomes to all involved. Her deep experience and skillset coupled with a sharp wit makes her Herculean work looks easy."
 },
 {
   "nominee": "Chin, Lorna ",
   "unit": "Gift Services",
   "quote": "Lorna brings grace under pressure to the Gift Services team."
 },
 {
   "nominee": "Cobb, Katie",
   "unit": "Evan's School of Public Policy & Governance",
   "quote": "Katie's collaborative approach, inherent drive, sharp instincts, and passion for the mission of the Evans School elevates our day-to-day experience as employees of this great school -- and will pay dividends over time, of that I'm sure. I admire her focus on strategy, on impact, and the way she encourages those around her to always take risks for the sake of something good. \n"
 },
 {
   "nominee": "Croak, Greg",
   "unit": "Foster School of Business",
   "quote": "Greg is a natural leader who inspires those around him with his incredible integrity and humility. He is highly committed to the values of the UW, Advancement, and creating great impact through his work in philanthropy."
 },
 {
   "nominee": "Daniels, Audra",
   "unit": "University Marketing & Communications",
   "quote": "Audra defines what it means to be an authentic collaborator and champion of unit programming. She makes everyone she comes into contact better!"
 },
 {
   "nominee": "Day Hase, Katherine",
   "unit": "Academic Student Affairs",
   "quote": "Good things become great when you focus on the details and Katherine never misses a step."
 },
 {
   "nominee": "DeMun, Grace",
   "unit": "People & Culture",
   "quote": "A highly collaborative and hard working employee who has taken the inaugural role of PaC's System Administrator, and created magic. Grace DeMun is  the bees knees and I'm over the moon to nominate someone so special."
 },
 {
   "nominee": "Devineni, Yvonne ",
   "unit": "College of Arts & Sciences",
   "quote": "Yvonne is committed to doing the job right!"
 },
 {
   "nominee": "Dixon, Miranda",
   "unit": "University Marketing & Communications",
   "quote": "Miranda has the drive and passion to do what is right and create meaningful impact. "
 },
 {
   "nominee": "Dore, Pamela ",
   "unit": "University Marketing & Communications",
   "quote": "With Pamela, the smallest details matter when it comes to helping others. And often it is those small things that make the biggest impact on people."
 },
 {
   "nominee": "Ellis, Cathy",
   "unit": "Intercollegiate Athletics",
   "quote": "Cathy is the heartbeat of our team and takes on projects that need to get done, no matter if they are hers to get done or not!"
 },
 {
   "nominee": "Evans, Lindsay",
   "unit": "Prospect Management, Research, & Analytics",
   "quote": "Lindsay is a powerhouse researcher for UW Medicine who has gone above and beyond during this pandemic. She's an integral part of the PD team and we would be lost without her (as would UW Medicine, I suspect)."
 },
 {
   "nominee": "Exell, Liz",
   "unit": "College of the Environment",
   "quote": "Liz artfully took on the huge challenge of planning and stewarding one of our largest international foundation donors, only to have to pivot at the last moment due to having to change and delay plans due to the pandemic. As we move forward to navigate in uncharted CFR waters, Liz is the kind of leader who can keep our faculty focused on their work, on the best moves for cultivating relations with new and existing funders, and to be strategic for where we need to focus next -- a star to guide us all."
 },
 {
   "nominee": "Fitzpatrick, Meghan",
   "unit": "Intercollegiate Athletics",
   "quote": "I constantly wish we had more than one Meghan not because she can not handle the load but she is a wizard with all that she is tasked with and I can only imagine how effective we would be as a team if we had twice that power."
 },
 {
   "nominee": "Flanders, Greg",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "A tenured member of the UWAA marketing and communications team, Greg is a trusted team player who brings his natural curiosity, attention to grammar and desire to help to the job everyday. "
 },
 {
   "nominee": "Fondaw, Emily",
   "unit": "Donor Relations",
   "quote": "Smart, curious, generous and kind. There is no better example of someone who truly represents everything that UW Advancement strives to be than Emily Fondaw. "
 },
 {
   "nominee": "Foss, Jessica",
   "unit": "Finance & Administration",
   "quote": "I feel safer and more supported with Jess Foss on the job. A true collaborator, she responds quickly to requests with grace, creativity, and an amazing capacity to improvise. But she also proactively anticipates and solves problems in the spirit of \"It Starts with Me.\" "
 },
 {
   "nominee": "Gano, Zoe ",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Zoe is a joy to work with, she is kind, patient, organized and hard-working! She is the first to step up to take on a new project and brings her positivity and can-do attitude to work everyday."
 },
 {
   "nominee": "Garrand, Jaime ",
   "unit": "University Marketing & Communications",
   "quote": "Jaime has been an invaluable member of UMAC since she started, keeping track of dozens of projects while moving them along simultaneously. Her spirit of collaboration and willingness to get into the weeds to sort out the tangled web of projects has made our remote work both possible and run smoother than anticipated."
 },
 {
   "nominee": "Gerrard, Zanne",
   "unit": "College of the Environment",
   "quote": "Her commitment to the mission of the university and our college is unwavering, no matter the circumstance."
 },
 {
   "nominee": "Goodloe, Amy",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Amy is an incredible positive influence, especially in these uncertain times. All of us can count on her for the help we need!"
 },
 {
   "nominee": "He, Jodie",
   "unit": "Finance & Administration",
   "quote": "Jodie is a rock star and a master at what she does and always with a great attitude."
 },
 {
   "nominee": "Higgins, Jane",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Creativity, innovation, collaboration and respect are all actions that Jane brings to her work every day."
 },
 {
   "nominee": "Honaker, Lauren",
   "unit": "Corporate & Foundation Relations",
   "quote": "Lauren is our secret weapon when working with faculty on large foundation grants and her behind the scenes tracking and questioning increases the amount of trust our faculty have in advancement."
 },
 {
   "nominee": "Iyall, Dave",
   "unit": "College of the Environment",
   "quote": "Dave Iyall creates a warm and supportive atmosphere where our fundraisers and staff thrive and grow. He approaches cultivating our team in the same way he approaches donor cultivation, with intentional care and integrity. He is invested in the success of each person within our unit, the UA team, and university as a whole. "
 },
 {
   "nominee": "Jackson, Brian",
   "unit": "Information Management",
   "quote": "Brian is a fierce advocate for his team and the impact work that they do. His vision has allowed the TLT team to grow themselves both professionally and personally, setting them up for success in all that they do. "
 },
 {
   "nominee": "Jacobson, Meredith",
   "unit": "University Marketing & Communications",
   "quote": "A good editor simply makes everyone better. Meredith Jacobson joined UW as a very good editor; not just a proofreader, but as a creative collaborator who can craft language and story, elevating every project she touches. She does this with exceptional professionalism, patience and kindness.She is a respected voice in many collaborative, cross-unit and interdisciplinary committees. She maintains these campus-wide standards with clarity and grace, campus and as such, has helped make UW communications more impactful. Meredith led the creation of equitable language guide, which gives communicators tools to speak inclusively to our entire community."
 },
 {
   "nominee": "Klask, Caitlin",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "UWAA's Marketing Efforts rely on the excellence and collaborative spirit of Caitlin Klask."
 },
 {
   "nominee": "Kromer, Ed",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Ed Kromer is a detective, a journalist, a master storyteller, a savvy blogger, and skilled creative director who discovers and crafts compelling stories that move and engage alumni and stakeholders of the Foster School of Business. His stories build a sense of pride and connectedness at every level, from students, staff, and faculty, to alumni, supporters, influencers and the community at large."
 },
 {
   "nominee": "Krueger, Andrew",
   "unit": "Foster School of Business",
   "quote": "As we work toward Advancement 3.0 and true integrated efforts where the whole is so much more than the sum of the parts, we have a wonderful, living, breathing, leading model in Andrew Krueger. "
 },
 {
   "nominee": "LaForge, Monet",
   "unit": "School of Public Health",
   "quote": "Monet's desire to contribute meaningfully to team conversations, roundtable discussions, and school initiatives reminds me of how much she sees our work not just as a paycheck but as a way to impact communities."
 },
 {
   "nominee": "LaVerdiere, Lora",
   "unit": "Prospect Management, Research, & Analytics",
   "quote": "Every team needs a great admin even in the best of times, but this is not the best of times. So we are extra lucky to have Lora."
 },
 {
   "nominee": "Lawson, Eric ",
   "unit": "College of Education",
   "quote": "Eric is a true leader and mentor; always guiding with integrity, collaboration and excellence. "
 },
 {
   "nominee": "Lowry, Elizabeth",
   "unit": "Academic Student Affairs",
   "quote": "Everyone has a plan until you get punched in the gut.  At that point you are thankful that you have Elizabeth's solutions first, what's best for the university, witty partnership to get you back on your feet.  \n"
 },
 {
   "nominee": "Luster, Johnathan",
   "unit": "Regional Advancement",
   "quote": "Johnathan is a thoughtful professional who has faced all the challenges thrown at him this year with positivity, creativity, and a ton of hard work. Bravo!"
 },
 {
   "nominee": "Maccormack, Jennifer",
   "unit": "Annual Philanthropy",
   "quote": "Jen is an innovator, leader, and inspiration to her team and her peers. She is paving the way for the AP team to be a national model of success and transforming the way way we engage our donors for more meaningful outcomes that will advance the university in numerous ways."
 },
 {
   "nominee": "Maloy, Sarah",
   "unit": "Advancement Operations",
   "quote": "Sarah is one of the most trusted and respected members of the Information Management team."
 },
 {
   "nominee": "Marazzi, Chiara",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Whether it be visualizations, Italian, spreadsheets or project kickoffs; Chiara is fluent in all the languages she needs to make Advancement great."
 },
 {
   "nominee": "Matthews, Meg",
   "unit": "University Marketing & Communications",
   "quote": "Our University and our community are better informed - and we are better able to hear and meet their needs - thanks to the work of Meg Matthews."
 },
 {
   "nominee": "McGraw, Priscilla",
   "unit": "Annual Philanthropy",
   "quote": "Priscilla is chalk-full of creative ideas that help bring teams together!"
 },
 {
   "nominee": "McGraw, Priscilla",
   "unit": "Annual Philanthropy",
   "quote": "Priscilla puts the \"fun\" in fundraising as a strong collaborative partner and resource for her Advancement peers and students. Her efforts are an essential part of the overall success of increasing our impact."
 },
 {
   "nominee": "McGrew, Nichole ",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Nichole is an exemplary employee whose day-to-day work continues to meet and usually exceeds the STAR award criteria."
 },
 {
   "nominee": "McHenry, Den",
   "unit": "School of Law",
   "quote": "Den is always the first person in every conversation to encourage the rest of us to think of the user, to adhere to best practices and to work collaboratively so that the communications that live on our website represent the very best of UW Law."
 },
 {
   "nominee": "McIntire, Rebecca (Becky)",
   "unit": "College of Arts & Sciences",
   "quote": "I do not know anyone more universally admired and adored! This is a direct reflection of who Becky is as a person, including but not limited to her hard work, kindness, and willingness to help."
 },
 {
   "nominee": "Mead, Alethia",
   "unit": "Intercollegiate Athletics",
   "quote": "Alethia brings an unmatched energy and glow to her work in UA. Both with her colleagues and donors she is constantly preaching the impact of UA across UW, Seattle and the state of WA."
 },
 {
   "nominee": "Miller, Korrie",
   "unit": "Intercollegiate Athletics",
   "quote": "The thought of Korrie leaving our team is absolutely petrifying. I want her to know that we would be lost without her and need her around for a long time!"
 },
 {
   "nominee": "Minear, Andrew",
   "unit": "Regional Advancement",
   "quote": "Andrew did a superb job of balancing his managerial responsibilities for the west coast regional team and his interim role as CAO for Nursing. He demonstrates integrity in his leadership and he empowers his teams through trust and openness. He is a huge asset to UW and all who work alongside him."
 },
 {
   "nominee": "Moon, Christina",
   "unit": "Gift Services",
   "quote": "Christina Moon is a go-to, can-do powerhouse."
 },
 {
   "nominee": "Muirhead, Emily ",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Emily is thoughtful, hard-working, innovative and creative! She bringing laughter, flexibility and a strong work ethic to every project she touches and never shies away from a challenge."
 },
 {
   "nominee": "Newlin, Kelsey",
   "unit": "Information Management",
   "quote": "I love getting to work with Kelsey every day, and her hard-working attitude allows TLT to reach so many more people and do so many more cool projects"
 },
 {
   "nominee": "Olsen, Greg",
   "unit": "School of Law",
   "quote": "Greg approaches every assignment with kindness, compassion and an exacting drive to fully bring UW Law stories and work to life. Thanks to Greg's dedication, UW Law is able to create relatable, engaging content that demonstrates the life-changing efforts by faculty, staff, alumni, donors and other members of our community."
 },
 {
   "nominee": "May Oo, Thu Thu",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Thu Thu always strives to go above and beyond to help our alumni and friends who contact the UWAA. She is a great asset to the Advancement team!"
 },
 {
   "nominee": "Patzwald, Allison",
   "unit": "Prospect Management, Research, & Analytics",
   "quote": "Allison has an innovative and collaborative spirit, and is a joy to work with!"
 },
 {
   "nominee": "Peter, Julie ",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "\"Being Julie\" is the answer to the question \"what superpower do you wish you had?\" Whether it's being the shinning light in the office or rocking event management out in the field, she's the superhero UWAA needs right now!"
 },
 {
   "nominee": "Peterson, Daniel ",
   "unit": "Foster School of Business",
   "quote": "'Nothing so conclusively proves a man's ability to lead others, as what he does from day to day to lead himself.' ~ Thomas J. Watson"
 },
 {
   "nominee": "Phan, Kathleen",
   "unit": "College of the Environment",
   "quote": "When a challenge emerges, Kathleen is always quick to jump-in and volunteer with hard work and solutions, and she's never afraid to get her hands dirty. She quickly adapts to shifting priorities with new ways of thinking and creates endless opportunities to further her relationship with EarthLab donors. "
 },
 {
   "nominee": "Plonski, Mike",
   "unit": "Intercollegiate Athletics",
   "quote": "Mike bleeds purple and gold and his commitment to the success and continuity of UW and UA is unparalleled.  "
 },
 {
   "nominee": "Rasmussen, Natalie",
   "unit": "UW Medicine: Campaign",
   "quote": "Natalie got the COVID-19 hotline up and running fast!"
 },
 {
   "nominee": "Rey, Helen",
   "unit": "Regional Advancement",
   "quote": "Helen is a terrific ambassador for the University of Washington and Regional Advancement. She is a bright, diligent, thoughtful, and motivated colleague. She is a leader on the Regional Advancement team and her insights are a tremendous asset. "
 },
 {
   "nominee": "Roy, Jacob",
   "unit": "Information Management",
   "quote": "Jacob's can-do attitude and timely help are true reflection of Advancement 3.0."
 },
 {
   "nominee": "Salisbury, Kate ",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Even though Kate's appointment is short-term, her ability to jump into new projects has helped her to create a lasting impact on the UW Alumni Tours program.  "
 },
 {
   "nominee": "Shafer, Ken",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Ken Shafer's ability to create a terrific summer issue of UW Magazine under our stressful, work-from-home conditions, and accommodate the tremendous amount of content that changed up to the last minute, is a testament to his creativity, innovative thinking -- and his passion for the University. The impact of his work was just as powerful as when he produced the magazine under normal circumstances. Amazing."
 },
 {
   "nominee": "Sherman, Joseph",
   "unit": "Foster School of Business",
   "quote": "Joseph has been a superb mentor and leader to many at Foster School and all of UW."
 },
 {
   "nominee": "Shubat, Danielle",
   "unit": "School of Pharmacy",
   "quote": "Every win, success, or advancement activity over the past year has been touched by Danielle's spirit, her kindness, and her undaunted work ethic!"
 },
 {
   "nominee": "Siem, Staishy ",
   "unit": "School of Law",
   "quote": "Staishy Bostick Siem is an exemplary mentor who serves multiple leadership roles with distinction, fosters an inclusive culture of communication among her team and internal clients, and tackles challenges with a thoughtful, sensitive and effective approach. Simply put, you cannot spell 'The University of Washington School of Law Marketing and Communications Department' without 'Staishy.'"
 },
 {
   "nominee": "Spratt, Fernanda ",
   "unit": "People & Culture",
   "quote": "Fernanda is a standout who embodies the University value of excellence, and coaches me as a manager to help bring out excellence in my team."
 },
 {
   "nominee": "Stone, Mark ",
   "unit": "University Marketing & Communications",
   "quote": "Mark is the epitome of collaboration. He works incredibly hard to reach across units to share information and build great teams."
 },
 {
   "nominee": "Storms, Andrew",
   "unit": "College of the Environment",
   "quote": "Andrew has demonstrated a wonderfully collegial nature, thoughtfully checking-in with colleagues, referring donors within his network to other environment units, and leaning-in on collaborative strategies. He brings a unique skillset to the team that has helped elevate our events, programming, and strategic decisions. "
 },
 {
   "nominee": "Stringer, Courtney",
   "unit": "UW Medicine: Campaign",
   "quote": "Courtney is a driven fundraiser who has pushed forward the fundraising capacity in the Neurosciences. She maximizes the resources available to her and creates strong, collaborative relationships with the faculty she works with. "
 },
 {
   "nominee": "The IT Team",
   "unit": "Information Management",
   "quote": "The IT team really made it possible for the rest of Advancement to do our work remotely at the drop of a hat when the COVID-19 pandemic hit. Thank you all!"
 },
 {
   "nominee": "Tobosa, Holly",
   "unit": "Principal Giving",
   "quote": "Be Boundless may be ending, but with Holly's great work we can rest assured that future fundraising campaigns and initiatives will thrive - thanks in part to her work identifying and spotlighting new high capacity donors for qualification and engagement. "
 },
 {
   "nominee": "Toomey, Michael",
   "unit": "Annual Philanthropy",
   "quote": "Michael is a rising STAR and is helping to lead the way in developing our digital fundraising efforts from top to bottom. His efforts are vital to our ability to create meaningful fundraising campaigns, improved donor experiences, and increased philanthropic participation from the alumni and friends of UW."
 },
 {
   "nominee": "Trachtenberg, Maya",
   "unit": "College of Education",
   "quote": "We create impact. With Maya we create WONDERFUL and MEANINGFUL impact beyond what anyone expects."
 },
 {
   "nominee": "Tran, An",
   "unit": "Regional Advancement",
   "quote": "An makes everyone around her better. She is a role model for utilizing the best practices for working with donors and colleagues alike. "
 },
 {
   "nominee": "Vargas, Lisa",
   "unit": "Information Management",
   "quote": "The importance of her contributions to the CRM conversion project cannot be overstated."
 },
 {
   "nominee": "Walters, Diane",
   "unit": "College of the Environment",
   "quote": "Diane has continued to engage donors with enthusiasm and tackles challenges fearlessly. We are excited to see the impact of her work as she builds relationships internally and externally with those in the UW Botanic Gardens, Earth and Space Sciences, and School of Environmental and Forest Science departments. "
 },
 {
   "nominee": "Warming, Tara",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "In a few-years time, we will look back and see that Tara's work with our young alumni was a turning point for our school. "
 },
 {
   "nominee": "Waugh, Alex",
   "unit": "Annual Philanthropy",
   "quote": "Alex is the ultimate teammate. He is truly a joy to work with and an irreplaceable asset to the APAA team and the advancement efforts of the university."
 },
 {
   "nominee": "White, Taylor",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Taylor White is the ultimate purple and gold team player. She shares her knowledge, passion for the UW, collaborative nature, humor and awesome work ethic with us all. We, and the UWAA are better for it, and her."
 },
 {
   "nominee": "Williams, Kearstin",
   "unit": "College of the Environment",
   "quote": "Kearstin's insatiable curiosity to keep learning and exploring professional development raises the bar of the many ways she supports our team, not just doing the job needing to be done, but understanding how tasks are connected to a greater network of relationship building. She is a great asset to our team and will be a rising star in UW Advancement for many years to come."
 },
 {
   "nominee": "Winn, Nick",
   "unit": "Intercollegiate Athletics",
   "quote": "Nick took the lead on Husky Giving day last year and produced incredible results not only for athletics but set a standard in good practice and strategies for all campus colleagues."
 },
 {
   "nominee": "Wise, Dennis ",
   "unit": "University Marketing & Communications",
   "quote": "Remaining on campus and photographing everything from the Virology lab, to nurses working the front lines, to capturing the cherry blossoms for those who could not be on campus, Dennis has shown true dedication and an understanding that the Advancement mission matters."
 },
 {
   "nominee": "Worrall, Kaela ",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Kaela starts and meets a global pandemic, current projects, and transition to a new role head on -- and rocks it!"
 },
 {
   "nominee": "Yocum, Brittany",
   "unit": "Evans School of Public Policy & Governance",
   "quote": "Brittany's dedication to her work and advancing the mission of the Evans School is exemplary. She approaches her work and accomplishes her goals with a curiosity, positivity, and commitment to excellence that make her a successful and very much appreciated member of our team."
 },
 {
   "nominee": "Young, Stephanie",
   "unit": "Alumni & Stakeholder Engagement",
   "quote": "Steph has made a lasting impression on the UW Alumni Tours program. Her ability to find new and better ways to streamline processes has saved valuable time while simultaneously improving the final product. "
 },
 {
   "nominee": "Zalewski, Namrata ",
   "unit": "Information Management",
   "quote": "No one matches Namrata's ability to understand users' needs and build a data set that can run a report so accurately and quickly."
 }
]