[
    {
        "nominee": "Blake, Tomitha",
        "unit": "Academic & Student Affairs",
        "quote": "Tomitha deeply values the people she works with - from donors to students to staff members - and finds ways to lift them up to be the very best versions of themselves.  She is truly wonderful human with a heart of gold (and purple!). "
    },
    {
        "nominee": "Team, Endowment and Donor Services",
        "unit": "Development Services",
        "quote": "The Endowment & Donor Services team is leading transformative work for UW Advancement to realize our greatest impact!"
    },
    {
        "nominee": "Jagannathan, Malavika",
        "unit": "University Marketing and Communications",
        "quote": "Malavika’s talents are only surpassed by her kindness, compassion, and wicked sense of humor. She is a master of her craft and fortunately for all of us, has dedicated herself to using it for the good of the people of Washington. "
    },
    {
        "nominee": "Ngo, Julie",
        "unit": "Information Management",
        "quote": "Julie is dedicated to excellence, belonging, and compassion, bringing out the best in others on her team and throughout Advancement. Julie's light is powerful and shines on all who have the privilege of working with her. "
    },
    {
        "nominee": "Marsh, Sean",
        "unit": "UW Bothell",
        "quote": "Sean shepherded the UW Bothell Advancement team through an extended leadership transition, amidst the many challenges we all faced during the first two years of COVID. But as anyone who is lucky enough to interact with Sean, knows he still smiling and helping us all remember the heart and true purpose of our work.  "
    },
    {
        "nominee": "Riutta, Kelly",
        "unit": "Prospect Development",
        "quote": "Kelly is a tireless advocate for her team, and an innovator in prospect research. She is the force behind the new UA DEI Data Guide, having seen the project from initation to finish."
    },
    {
        "nominee": "Lewis, Leilani",
        "unit": "Diversity, Equity and Inclusion Strategic Planning",
        "quote": "Courageous in thought, word, and deed; vulnerable in action; warmhearted in speech. Fully alive and fully realized. Uses her eyes to see what is, and creates a vision for what can be. "
    }
]