[
    {
        "nominee": "Washington, Brandon",
        "unit": "UW Bothell",
        "quote": "Brandon is a hard-working, empathetic team member who brings honesty, kindness, and authenticity to every space he enters. He created from scratch a process to award a new, highly impactful scholarship award for UW Bothell for the immensely crucial Black Opportunity Fund. Brandon has gone above and beyond to ensure that UW Bothell leads by example when wanting to positively impact black and BIPOC students' experience within our institution."
    },
    {
        "nominee": "Chan, Christine",
        "unit": "UW Medicine",
        "quote": "Christine is a dedicated, strategic fundraiser who is laser focused on achieving transformational gifts that advance cancer research through skillful and thoughtful partnership with donors, faculty members and colleagues. She navigates our complex work with grace and tenacity, approaching her work with dedication but also heart. From creatively crafted holiday cards to a recipe book with personalized quotes, Christine is able to connect with donors on a human level, recognizing their individual stories and inspiring them to help others."
    },
    {
        "nominee": "Eng, Yolanda",
        "unit": "Alumni & Stakeholder Engagement",
        "quote": "Yolanda brings a fresh eye to the Membership program of UWAA, and does so with much grace and intentionality. She is a genuine advocate for a progressive and inclusive workplace that serves a diverse community of alumni, making incredible impact through her work in race and equity for UA and for UW as a whole. She has thoughtfully planned, hosted and partnered on events to engage with UWAA members and the Husky BIPOC community. Her work is truly transformational for both her colleagues, our alumni and the greater Seattle community."
    },
    {
        "nominee": "Gift Services Team ",
        "unit": "Advancement Operations",
        "quote": "The Gift Services team transitioned into the remote environment seamlessly - exemplifying hard work and integrity, collaboration and trust, service and the strive for excellence. The team worked to process gifts, create new budgets, handle an array of data, and respond to complex questions from our donors, Advancement colleagues, and unit partners. They took on receiving mail from many different departments to expedite gift processing times, rotating into the office in order to open mail, deposit checks, and to generate the batches for processing for team members working from home. The team exemplifies hard work and integrity, collaboration and trust, service and the strive for excellence."
    },
    {
        "nominee": "Su, Margaret",
        "unit": "University Marketing & Communications",
        "quote": "Margaret embodies UA values as well as UW values, all while bringing a great sense of humor and a can-do attitude to her team. She has had the important and tough job of launching the UW Current newsletter, a project with high visibility inside and outside of the UW. In UMAC she has also driven important conversations about equity, leveraging in her previous position at the Wing Luke Museum to think about ways to have more profound engagement with community. She is a true super star with all of the work she takes on that is dedicated to advancing UW."
    },
    {
        "nominee": "Williams, Kearstin",
        "unit": "College of Education",
        "quote": "Kearstin brought forth her optimism, energy, curiosity, and enthusiasm to the College of the Environment Team, successfully diving into stretch assignments to help with coverage. She brings the voice of a UW alumna, a passion for the mission, a dedication to diversity, and an attitude of getting things done to create impact that exemplifies the values of UW, UA and the 3.0 framework - all while going above and beyond her duties during a year like no other. Kearstin Williams is a true shining Advancement star."
    }
]