[
{
    "nominee": "Gordon, Cheryl",
    "unit": "ADV OPS",
    "quote": "She is passionate about her work and her team, expanding learning opportunities and reaching across all Advancement to instill community and belonging."
},
{
"nominee": "Abernathy, Heather",
"unit": "Development Programs:  Regional Advancement",
"quote": "She goes above and beyond in how she shows up for her teammates, both personally and professionally, to ensure we have the support and resources needed to do our best work."
},
{
"nominee": "Alldredge, Annie",
"unit": "UMAC",
"quote": "Her leadership, vision and collaborative spirit creates experiences that profoundly engage our community members - from students to donors - and advance the priorities of the entire University."
},
{
"nominee": "Antonio, Joyce",
"unit": "ASE",
"quote": "Her collaboration, creativity, reliability and positivity make her a standout UA colleague!"
},
{
"nominee": "Team, ASO",
"unit": "Development Programs:  Regional &amp; International",
"quote": "Every single day this team (Joey McFaul, Erin Richmond and Michelle LeSourd) goes above and beyond with their job duties. They regularly support other units across campus while always providing unparalled support to our own tea&emdash;identifying needs, solutions and strategies that support their colleagues in doing their very best work."
},
{
"nominee": "Bansfield, Safiya",
"unit": "Development: Arts &amp; Sciences",
"quote": "She is a collaborative powerhouse who goes above and beyond in her everyday job duties to communicate the impact of the College of Arts &amp; Sciences."
},
{
"nominee": "BouNakad, Firas",
"unit": "ASE",
"quote": "He is a go-getter who is undaunted by sticky logistics. He makes the impossible happen and keeps smiling the whole time."
},
{
"nominee": "Brinton, Matthew",
"unit": "Development: Academic Student Affairs",
"quote": "He brings a great amount of knowledge, passion and helpful ideas to our team. His ability to jump in quickly to  help with complex projects while also streamlining processes. He is a thoughtful and caring teammate and leader!"
},
{
"nominee": "Bucholtz, Michelle",
"unit": "ADV OPS",
"quote": "Michelle's dedication to UW values is reflected through her team's emphasis on collaboration, integrity and diversity. She's a fierce leader with a caring heart and always get the job done with grace!"
},
{
"nominee": "Carden, Angela",
"unit": "Development Programs: Corporate and Foundation Relations",
"quote": "She improves every proposal, stewardship piece and process she's involved in!"
},
{
"nominee": "Chapman, Allison",
"unit": "Development Programs: Prospect Development",
"quote": "She has gone completely above and beyond in making sure Tandem is a success for our stewardship and frontline fundraiser teams. She has found so many high-priority bugs, she should have a golden flyswatter."
},
{
"nominee": "Clark, Nova",
"unit": "Development: Environment",
"quote": "She is a rising star in the Advancement galaxy. She has stepped up in a big way moving key CFR donor relationships forward."
},
{
"nominee": "Colburn, Kerry",
"unit": "UMAC",
"quote": "She is a natural collaborator with a storyteller’s eye and great empathy for our audiences. She is a positive, accessible, results-focused team builder and supportive, respectful manager."
},
{
"nominee": "Danson , Kristyn",
"unit": "Development: iSchool",
"quote": "When you say it can't be done, she takes that as a challenge to make the impossible possible. From launching an international alumni newsletter to sending birthday greetings, she's making alumni feel connected in new ways."
},
{
"nominee": "Dennehy, Jere",
"unit": "ADV OPS",
"quote": "Jere is constantly looking for ways to improve our processes and finding efficiencies. She does all of this quickly, accurately and with a positive attitude."
},
{
"nominee": "Dixon, Miranda",
"unit": "UMAC",
"quote": "She embodies our UW &amp; UA values, always putting the University's best interest at the forefront. She goes above and beyond to make sure our partners and stakeholders walk away with the best experience possible."
},
{
"nominee": "Dugan, Angela",
"unit": "Development Programs:  Regional Advancement",
"quote": "She is a thoughtful, strategic and successful fundraiser who consistently goes above and beyond her job description. She is a valued partner to colleagues across Advancement."
},
{
"nominee": "Franke, Hannah",
"unit": "Development: UW Med",
"quote": "She is a natural collaborator, creative thinker and all around joy to work with who always puts the donor and donor experience first in her work."
},
{
"nominee": "Haas, Genevieve",
"unit": "UMAC",
"quote": "Her name may not appear on most of what she does, but her work has a tremendous positive impact on our entire University."
},
{
"nominee": "Harvey, Lana",
"unit": "Development Programs: Prospect Development",
"quote": "She brings joy and movement to the BIPOC Community!"
},
{
"nominee": "Haskins, Kris",
"unit": "ADV OPS",
"quote": "Kris helped the Finance and PaC teams create an online version of a frequently used and complicated form in the UA's Central Support Portal. We are so appreciative of the process improvements he did with patience and provided timely support whenever we needed it!"
},
{
"nominee": "He, Jodie",
"unit": "ADV OPS",
"quote": "She is a reservoir of knowledge and a very helpful colleague."
},
{
"nominee": "Hine, Louise",
"unit": "Advancement Strategy and Campaigns",
"quote": "Lou takes great pride in improving processes and thinking holistically about the overall experience and engagement points for all involved. The Foundation Board membership is large and the calendar is complex, but this Star provides a concierge service that truly puts people and relationships first."
},
{
"nominee": "Jacobson, Meredith",
"unit": "UMAC",
"quote": "She raises us all with her compassion for the UW community. She truly is a star that we all follow and look to for direction."
},
{
"nominee": "Jonsson, Bryndis",
"unit": "ASE",
"quote": "A steady and experienced hand&emdash;unflappable asset to our events team!"
},
{
"nominee": "Kim, Marianne",
"unit": "Development Programs: Regional Advancement",
"quote": "Through detailed project management and insightful questioning, she creates events that are welcoming and drive profound engagement. "
},
{
"nominee": "Kitagawa, Megan",
"unit": "Development: UW Tacoma",
"quote": "She  has a rare, unique combination of consistently demonstrating award-winning, innovative creativity as well as a team orientation that is humble, inclusive, compassionate, fun and dependable beyond measure."
},
{
"nominee": "Le, Evie",
"unit": "ADV OPS",
"quote": "She gets stuff done and does it well, all while being a kind and collaborative colleague."
},
{
"nominee": "Lepper, Tracy",
"unit": "UMAC",
"quote": "She is a thoughtful, inclusive and team-focused leader, who is skilled in event strategy, guest experience design and project management. She can unravel even the most daunting projects to create a smooth and gratifying experience for everyone around her."
},
{
"nominee": "LeSourd, Michelle",
"unit": "Development Programs:  International Advancement",
"quote": "She keeps our team moving (literally planning travel around the globe) and keeps us committed to Advancement’s values and to creating positive impact around the world. "
},
{
"nominee": "Lopez, Diana",
"unit": "Development: UW Tacoma",
"quote": "She is a powerhouse and can do it all!"
},
{
"nominee": "McGinnis, Sean",
"unit": "ASE",
"quote": "He is the embodiement of a Star Award recipient who excels at creating a positive and enjoyable work environment for his ASE colleagues while making a positive impact with our UWAA members."
},
{
"nominee": "McGraw, Priscilla",
"unit": "Development Programs: Annual Philanthropy",
"quote": "Her expertise in annual philanthropy and digital fundraising has made her a powerhouse in her field, coupled with her willingness to share her skills and knowledge with her peers and colleagues. In addition, she co-chairs Development Programs' JEDI (Justice, Equity, Diversity and Inclusion) Collaborative with compassion and transparency."
},
{
"nominee": "Mercado, Elizar",
"unit": "Development: SPH",
"quote": "He's imaginative designs light up our status as a premier school of public health, making us shine like never before!"
},
{
"nominee": "Olsen, Lauren",
"unit": "UMAC",
"quote": "She truly embodies UA's collaboration/our best work is done together value. She is outstanding at respecting the opinions of others and bringing many voices to the table to achieve what is best for all, never putting her own opinion above others."
},
{
"nominee": "Peng, Qing",
"unit": "ADV OPS",
"quote": "She is a force of positivity and cheerfulness."
},
{
"nominee": "Poast, Jenny",
"unit": "Development: A&amp;S",
"quote": "She is an exceptionally effective fundraiser as well as a keen strategist and a masterful builder of relationships who blends big picture thinking with realistic pragmatism. She is a force for good!"
},
{
"nominee": "Rector, Janeka",
"unit": "Development: Engineering",
"quote": "She is a community builder whose infectious smile and openness to create meaningful space for all involved."
},
{
"nominee": "Schwartz, Erin",
"unit": "Development: Engineering",
"quote": "Transdisciplinary initiatives and cross-unit collaborations can be challenging, but she is a dream partner&emdash;thoughtful and thorough. She's led Engineering's CFR team to extraordinary heights of performance with millions of dollars in gifts plus 99 Industry Capstone Projects secured!"
},
{
"nominee": "Sevareid, Tiffany",
"unit": "UMAC",
"quote": "She, along with two colleagues, truly embody the concept of \"our best work is done together\" and \"we create impact\" by building and tweaking a new WordPress theme that WordPress users across the UW who will be able to deliver their own messages about the university to the outside world."
},
{
"nominee": "Shelton, Teri",
"unit": "UMAC",
"quote": "She, along with two colleagues, went above and beyond when creating a WordPress theme that users across the UW can implement on their own sites. These three demonstrate how collaboration can make an incredible impact on the work that the university is doing."
},
{
"nominee": "Snively, Samantha",
"unit": "UMAC",
"quote": "She is an excellent collaborator and colleague, working thoughtfully across the entire advancement enterprise!"
},
{
"nominee": "Soker, Noam",
"unit": "Development: Education",
"quote": "She is a stewardship and event powerhouse who not only does excellent work for her unit but also shares with others across the university."
},
{
"nominee": "Spratt, Fernanda",
"unit": "ADV OPS",
"quote": "She embodies what it means to do our best work together. She is a kind collaborator, a creative problem-solver and a UA Star!"
},
{
"nominee": "Storms, Andrew",
"unit": "Development: Environment",
"quote": "He represents everything that UA holds dear&emdash;integrity, excellence and a commitment to creating impact for UW. He's a kind colleague, a gifted communicator and a strong advocate for UW."
},
{
"nominee": "Stringer, Kate",
"unit": "Development: Public Health",
"quote": "Her riveting narratives showcase the School of Public Health's commitment to scientific innovation, inclusivity and promoting health equity for all."
},
{
"nominee": "Tang, Yue",
"unit": "Development: Education",
"quote": "She brings light and ease to her role on supporting the CoE team."
},
{
"nominee": "Tes, Sophanna",
"unit": "ASE",
"quote": "He is a great asset to the Advancement community!"
},
{
"nominee": "Tobosa, Holly",
"unit": "Development Programs: Principal Giving",
"quote": "Her work on the PGP team has been as an ultimate collaborator and creative mastermind, while also being a strong partner on Development Programs' Justice, Equity, Diversity and Inclusion (JEDI) Collaborative  ensuring we keep moving the work forward."
},
{
"nominee": "Truong, Melissa",
"unit": "ADV OPS",
"quote": "She is a force of nature!"
},
{
"nominee": "Urquhart, Sabrina",
"unit": "ASE",
"quote": "She is the easiest leader to talk to and the nicest one as well!"
},
{
"nominee": "Walker, Lisa",
"unit": "Development: UW Bothell",
"quote": "Her stellar event planning skills contribute to building meaningful and life-long relationships between individuals and the UW Bothell.  Her work may often be behind-the-scenes, however the impact she's had with two-plus decades at UW Bothell, cannot be overstated."
},
{
"nominee": "White, Lori",
"unit": "Development: Arts &amp; Sciences",
"quote": "She is a rising star on the A&amp;S Advancement team. While being new to UW, she has demonstrated a strong sense of integrity, a commitment to excellence and a collaborative mindset."
}
]