[
    {
        "nominee": "Kerr, Terra",
        "unit": "Advancement Operations",
        "quote": "Terra deserves every recognition in the book - she is smart, driven, thoughtful, and an amazing colleague and mentor to everyone she comes across. She brings her all to her work and it shows everyday. "
    },
    {
        "nominee": "Team, Gift Services",
        "unit": "Advancement Operations",
        "quote": "The Gift Services team has continued to be a bedrock of support during the pandemic, and their commitment to UW and UA values has been remarkable. From collaboration to innovation, a commitment to service and excellence, and always being a source of information and knowledge- we all could not have been successful these past two years without this remarkable team."
    },
    {
        "nominee": "Blake, Tomitha",
        "unit": "Academic and Student Affairs",
        "quote": "Tomitha deeply values the people she works with - from donors to students to staff members - and finds ways to lift them up to be the very best versions of themselves. I know that Tomitha is an outstanding boss, but she is also just a truly wonderful human with a heart of gold (and purple!). "
    },
    {
        "nominee": "Johnson, Dan",
        "unit": "College of Arts and Sciences",
        "quote": "Dan Johnson is the real life Ted Lasso. He inspires others to be their best and most authentic selves. #Believe"
    },
    {
        "nominee": "Joseph, Nancy",
        "unit": "College of Arts and Sciences",
        "quote": "The impact of the UW is best represented by our people - and those that write the stories of our people have a special responsibility to tell those stories authentically, clearly and inclusively. As the lead storyteller for the College of Arts and Sciences for three decades, Nancy Joseph is one of the best communicators at the UW. The care, compassion and organization she brings to her work is unmatched - and her ability to adapt and represent such a wide variety of programs and people is phenomenal."
    },
    {
        "nominee": "Mejia, Theresa",
        "unit": "College of Arts and Sciences",
        "quote": "Theresa works collaboratively, respectfully and tirelessly with her fundraiser partners to ensure that gifts coming in to the College of Arts & Sciences are true gifts of impact that will make the difference the donor is hoping to make and also will support the priorities of our departments, programs and centers. She truly believes the our best work is done together to create impact, and acts with integrity to support the process of getting to a shared understanding when we receive a gift."
    },
    {
        "nominee": "Mortensen, Kate",
        "unit": "College of Arts and Sciences",
        "quote": "Kate is a shining star. Her commitment, skill, and competence are valued everyday by leadership, her colleagues, deans and academic partners. "
    },
    {
        "nominee": "Williams, Jamilah",
        "unit": "College of Built Environments",
        "quote": "Jamilah has consistently brought positive leadership to CBE, UA, and UW since day one on our CBE Advancement team and even more so during recent, substantive staffing changes at our college. Everyone who has the privilege of working alongside Jamilah knows that she can be counted on as an exemplary collaborator who delivers excellent work to achieve shared goals."
    },
    {
        "nominee": "Barnett, Michelle",
        "unit": "Corporate & Foundation Relations",
        "quote": "Michelle is an excellent co-worker with great collaboration skills and a pleasure to work with as always!"
    },
    {
        "nominee": "Grant, Terry",
        "unit": "Corporate & Foundation Relations",
        "quote": "Terry has worked tirelessly to build impactful partnerships and programs across all three UW campuses that provide crucial support and life changing opportunities for our students. His colleagues truly value his kindness, dedication, wisdom and humor."
    },
    {
        "nominee": "Kale, Stephanie",
        "unit": "Development Services",
        "quote": "Stephanie's project management of the Gift Acceptance Policy rollout show-cased her exceptional skill of finding efficient pathways through complex processes, and her ability to focus the team's efforts with grace and good humor- we literally could not have done it without her!!"
    },
    {
        "nominee": "Team, EDS",
        "unit": "Development Services",
        "quote": "The Endowment & Donor Services team is leading transformative work for UW Advancement to realize our greatest impact!"
    },
    {
        "nominee": "Lewis, Leilani",
        "unit": "Diversity, Equity and Inclusion Strategic Planning",
        "quote": "Courageous in thought, word, and deed; vulnerable in action; warmhearted in speech. Fully alive and fully realized. Uses her eyes to see what is, and creates a vision for what can be. "
    },
    {
        "nominee": "Albright, Caleb",
        "unit": "College of Education",
        "quote": "Caleb's affable, can-do attitude and ability to problem solve highly technical issues has been especially valuable to our team -- we feel incredibly lucky to have him!"
    },
    {
        "nominee": "Arviso, Dana",
        "unit": "College of Education",
        "quote": "Dana's work and community-centered approach exemplifies what we think of when we say \"profound engagement\". She connects community to the college in a deep, authentic and meaningful way. "
    },
    {
        "nominee": "Jones, Lauren",
        "unit": "College of Education",
        "quote": "A true rock star who exhibits all the important aspects of effective leadership and development - strategy, empathy, intuition and passion. "
    },
    {
        "nominee": "Kellogg, Braxton",
        "unit": "College of Education",
        "quote": "Braxton brings a deep commitment to advancing educational justice, solutions-oriented mindset and warm interpersonal communication style that encourages genuine connection among his teammates. Our team is enhanced through his presence and the impact he brings!\r\r\n\r\r\n"
    },
    {
        "nominee": "Soker, Noam",
        "unit": "College of Education",
        "quote": "Noam is driven by the mission of our work and lives the values of the Haring Center and UW Advancement. She is committed to excellence and life-long learning to be able to do her job the best. "
    },
    {
        "nominee": "Trachtenberg, Maya",
        "unit": "College of Education",
        "quote": "Maya is the VP of FUN on our team who also leads with her brilliant mind and can-do attitude. "
    },
    {
        "nominee": "Wilcox, Charleen",
        "unit": "College of Education",
        "quote": "A committed leader who lives out the values of \"our best work is done together, we create impact\". Charleen is a true collaborator. I have seen her build relationships with colleagues in such an authentic way, and go to great lengths to rebuild relationships that were previously broken. She also deeply cares about the people she works with, for and who report to her. She has supported her team through transitions and uncertainty and has kept them feeling motivated and energized. I also appreciate Charleen's guidance and dedication to authentic DEI work that is routed in action. "
    },
    {
        "nominee": "DiCasparro, Jenna",
        "unit": "Endowment & Donor Services",
        "quote": "Jenna goes over and above to provide the best service to our units and fundraisers when crafting endowment and term gift agreements. Calm, poised, kind, and patient - she helps guide our fundraisers and our donors to a viable and impactful gift agreement, often navigating some of the trickiest political situations to the best possible outcomes for our donors and for the UW."
    },
    {
        "nominee": "Sullivan, Lynn",
        "unit": "Endowment & Donor Services",
        "quote": "Lynn is involved in so many initiatives and important policy decisions that advance our overall Advancement mission.  Fundraisers tend to receive the spotlight, but people like Lynn make the engine behind the curtain run and then steward all those \"good\" gifts we bring in the door!"
    },
    {
        "nominee": "Tran, Vuong",
        "unit": "Endowment & Donor Services",
        "quote": "Vuong goes above and beyond in support of My UW Giving and the Beneficiary Portal... He says yes to requests and projects for all the right reasons-- to make the donor experience and his colleagues jobs better. "
    },
    {
        "nominee": "Washington, Maliah",
        "unit": "Endowment & Donor Services",
        "quote": "She prioritizes agreements and revisions to help fundraisers be fully prepared for upcoming meetings, all while continuing to make headway on helping units make older funds more usable.  I also appreciate that she loves new challenges, hello GAP, and asks tough questions to help get us to a better place as an organization.  "
    },
    {
        "nominee": "Iyall, Dave",
        "unit": "College of Engineering",
        "quote": "Dave is smart, dedicated and supportive of his team and coworkers. He played an instrumental role in supporting the COE during a time of difficult transition and generously helped with the hiring/onboarding the new CAO. He kept the \"train moving\" so that new leadership would have the foundation necessary to hit the ground running. He did all of this while balancing multiple responsibilities including his fulltime job and his own career move to the College of Engineering. "
    },
    {
        "nominee": "Bucholtz, Michelle",
        "unit": "Finance and Administration",
        "quote": "Michelle is a great leader with passion for her job and care to her co-workers."
    },
    {
        "nominee": "Foss, Jessica",
        "unit": "Finance and Administration",
        "quote": "Jess' work is the foundation that ensures all of us can succeed"
    },
    {
        "nominee": "Moon, Christina",
        "unit": "Gift Services",
        "quote": "Christina is true to out best work is done together and creating impact to UW through her daily work. Christina has provided excellent support to the finance team for the audit and throughout the year. Her timely response and thorough research is very much appreciated. Thank you, Christina!"
    },
    {
        "nominee": "Ciesliga, Brent",
        "unit": "Information Management",
        "quote": "Always available and always helpful! I had an issue with my Excel application that required Brent’s Help. When I reached out to him he was immediately responsive. After attempting various possible solution it became clear that a new PC was needed. Without delay he setup a new machine for me. He spent considerable time to ensure a solution was found. I am very grateful for his help."
    },
    {
        "nominee": "Hamilton, Callie",
        "unit": "Information Management",
        "quote": "Callie is a powerhouse when it comes to TLT marketing and communications, making important decisions surrounding communications strategies when it comes to training updates, and is a true leader on the IM team. "
    },
    {
        "nominee": "Le, Evie",
        "unit": "Information Management",
        "quote": "When a task or project work is assigned to Evie, you can be sure that there will be a high quality deliverable.  "
    },
    {
        "nominee": "Newlin, Kelsey",
        "unit": "Information Management",
        "quote": "Kelsey has every leadership quality someone could hope for - strong decision making, thoughtful feedback, and truly excellent knowledge surrounding Cvent and the new CRM materials. She is an amazing manager and leader within IM!  "
    },
    {
        "nominee": "Ngo, Julie",
        "unit": "Information Management",
        "quote": "As the senior technical project manager for the Tandem CRM project, Julie is working on a high-profile project that will enable everybody in UA to better carry out our core function of making the UW stronger. She also created UA's International Women's Day event, sustained it through the pandemic and has seen it through to the amazing event we just had in 2022, with a session targeted to the needs of for BIPOC staff members. "
    },
    {
        "nominee": "Oakley, Daranee",
        "unit": "Information Management",
        "quote": "Daranee Oakley has been a stellar partner in the arduous process of converting our existing applications and interfaces for the Advance to Tandem migration.  She has stepped in to do work outside of her scope when needed, and is willing to challenge the status quo which results in better solutions for our stakeholders.  We are lucky to have Daranee on our team!"
    },
    {
        "nominee": "Pham, Nina",
        "unit": "Information Management",
        "quote": "Nina is a powerhouse in everything she takes on. She has been immensely impactful on our TLT team as well as within IM as a whole. She is a thoughtful leader, considerate colleague, and a true star within Advancement! "
    },
    {
        "nominee": "Tam, Louis",
        "unit": "Information Management",
        "quote": "Louis is dedicated and thorough."
    },
    {
        "nominee": "Danson, Kristyn",
        "unit": "Information School",
        "quote": "Kristyn believes our best work is done together and has established key partnerships to strengthen our alumni engagement. "
    },
    {
        "nominee": "Durflinger, Austin",
        "unit": "Information School",
        "quote": "Austin is an integral team member who encourages us all to attain new levels of excellence. He's thoughtful, proactive, thorough and disciplined. "
    },
    {
        "nominee": "Cato, Barron",
        "unit": "Market Research Analysis and Insight",
        "quote": "Barron's commitment to tackling big projects, and doing them the right way, makes him an excellent collaborator and such a valued partner in UA."
    },
    {
        "nominee": "Vincent, Jenny",
        "unit": "School of Nursing",
        "quote": "Jenny embodies UW and UA values by leading with clear communication, collaboration and integrity in her work as an FLF for the School of Nursing. Her positivity, optimism and a 'can-do' spirit lifts others up and makes us all better."
    },
    {
        "nominee": "Lyewlutatsing, Sacha",
        "unit": "People and Culture",
        "quote": "Sacha's impact on our team is immeasurable. She not only expertly guides us through all things talent managment, but does so with respect and kindness."
    },
    {
        "nominee": "Miles, Kelly",
        "unit": "People and Culture",
        "quote": "Kelly is a true star! She sparkles and shines in everything she does. Her unending positive attitude, her ceaseless energy, and infectious good nature is felt by everyone she comes across. She is an amazing leader and friend to all in Advancement!"
    },
    {
        "nominee": "Neals, Felix",
        "unit": "People and Culture",
        "quote": "Action drive with focus on employee well being."
    },
    {
        "nominee": "Lessard, Christine",
        "unit": "Philanthropic Recognition Programs",
        "quote": "Christine should be a role model for all leaders at UW. She is trusting, honest, open, and kind. She is always open to collaboration  - she brings our team together with humility and transparency."
    },
    {
        "nominee": "McFaul, Joey",
        "unit": "Planned Giving",
        "quote": "Joey's willingness to take on projects outside of the scope of her job and help extend our ability to stay engaged with donors exemplifies our values of excellence, collaboration, and impactful  work. "
    },
    {
        "nominee": "Lawson, Eric",
        "unit": "Principal Giving",
        "quote": "Eric is the type of colleague that will work work hard to innovate and make things happen while pumping others to accomplish a common goal. "
    },
    {
        "nominee": "Seibert, Erica",
        "unit": "Principal Giving",
        "quote": "She makes time in her schedule for what some might perceive as complex onerous projects and brings a calm focused presence to them. She makes the time and bandwidth to reach out to her teammates and ask whether they have a burden she can help lift."
    },
    {
        "nominee": "Ruitta, Kelly",
        "unit": "Prospect Development",
        "quote": "Kelly's work represents Advancement values at their best. She actively seeks to understand priorities and projects across UA, and iterates happily with partners across the organization to create elegant solutions that advance the UW's impact."
    },
    {
        "nominee": "Ingram, Megan",
        "unit": "School of Public Health",
        "quote": "Megan Ingram is a rock star when it comes to integrating her Advancement team. She constantly seeks ways to leverage the various talents of the team members to strengthen the visibility and reputation of the School of Public Health. "
    },
    {
        "nominee": "Ingram, Megan",
        "unit": "School of Public Health",
        "quote": "Megan steps up when someone needs help and offers kind, warm, thoughtful and authentic gestures of support when someone is struggling. She encourages vulnerabilities and extends patience as we work through them."
    },
    {
        "nominee": "Mercado, Elizar",
        "unit": "School of Public Health",
        "quote": "Elizar’s creative vision and multimedia skills take the UW School of Public Health to a higher level."
    },
    {
        "nominee": "Minato, Jasmine",
        "unit": "School of Public Health",
        "quote": "It starts with me. In her first three months at UW, Jasmine spearheaded our SPH Alumni Impact Award selection process, rollout and planning in addition to securing key challenge gifts for Husky Giving Day and working with each of our 5 departments (and 3 interdisciplinary pgorams) to ensure its success."
    },
    {
        "nominee": "Shafii, Shiva",
        "unit": "School of Public Health",
        "quote": "Shiva is a talented, patient, smart and collaborative member of the SPH Advancement team who values the ideals of inclusiveness, representation, stakeholder engagement and creative problem solving.  As a consummate professional, she leverages her experience and wisdom as a trusted partner for our team, our faculty, our students and our leadership team."
    },
    {
        "nominee": "Shannon, Kelsea",
        "unit": "School of Public Health",
        "quote": "Kelsea's selfless advocacy for the communities we serve is manifested in her drive to excel, to innovate and collaborate across diverse teams, and to maximize our resources to align strategically with UA's mission and goals. Kelsea's bold and impactful leadership is felt laterally, and her humility is noticed as she drives our team to a margin of excellence."
    },
    {
        "nominee": "Shannon, Kelsea",
        "unit": "School of Public Health",
        "quote": "Our best work is done together. We create impact. Kelsea stands out as a star for so many reasons. She has "
    },
    {
        "nominee": "Van Hoy, Liz",
        "unit": "School of Public Health",
        "quote": "Liz is a motivated, thoughtful and trusted leader.  Her people-first approach to management  has propelled her team to pilot new ideas, value best practices and showcase individual team member's strengths in a way that drives fundraising strategies while authentically demonstrating care for all people in the School of Public Health."
    },
    {
        "nominee": "Kreptul, Melissa",
        "unit": "Office of the Senior Vice President",
        "quote": "Melissa goes above and beyond to ensure we all know how to best work with Mary and helps us fully understand intentions behind any requests and questions that come to our teams. "
    },
    {
        "nominee": "Cannon, Alanya",
        "unit": "University Marketing and Communications",
        "quote": "Alanya has a deep commitment to the UW and its brand, and she is a kind, thoughtful, strategic, helpful collaborator. If you have seen something with purple on it and in the public space, chances are Alanya has had input on it. Her brand victory lap at the Marketing Roundtable is so important for not only the morale boost, but also is a powerful signal to unit leadership that our teams are doing good work."
    },
    {
        "nominee": "Druliner, Dan",
        "unit": "University Marketing and Communications",
        "quote": "Dan’s superpower is his care for the people around him – a rare skill that is often underappreciated. From his work building and strengthening connections with the partners he serves, to fostering community through his leadership in the Drupal Community of Practice, to the care he shows for his teammates, Dan takes pride in the relationships he builds and maintains."
    },
    {
        "nominee": "Grady, Caitlin",
        "unit": "University Marketing and Communications",
        "quote": "Caitlin's often behind the scenes work around internal communication has not gone unnoticed - in times of such change she's been an incredible leader and communicator!"
    },
    {
        "nominee": "Hendrickson, Jeff",
        "unit": "University Marketing and Communications",
        "quote": "Jeff’s leadership in building community through Web Council creates deep, personal impact to the people who attend each month. His meaningful and purposeful interactions have created safe spaces for professionals to gather, learn, and grow during difficult times."
    },
    {
        "nominee": "Jagannathan, Malavika",
        "unit": "University Marketing and Communications",
        "quote": "Malavika’s talents are only surpassed by her kindness, compassion, and wicked sense of humor. She is a master of her craft and fortunately for all of us, has dedicated herself to using it for the good of the people of Washington.   "
    },
    {
        "nominee": "Lepper",
        "unit": "University Marketing and Communications",
        "quote": "UA events shine because of Tracy's commitment to the partners and people they serve. Creating impactful experiences for the husky community is more comparable to a duck than a trusty dog. While on the surface, Tracy gracefully glides through troubled waters with ease, underneath the waves, she’s paddling like crazy, keeping us all moving in the right direction.  "
    },
    {
        "nominee": "Sevareid, Tiffany",
        "unit": "University Marketing and Communications",
        "quote": "While much of her work is behind the scenes, Tiffany plays an amazingly large part in advancing the UW, strengthening the reputation and the brand, and creating impact across the globe. The impact she creates touches millions of perspective students and their families."
    },
    {
        "nominee": "Shelton",
        "unit": "University Marketing and Communications",
        "quote": "In her few short years with UMAC’s Web Strategy team, Teri has done more to transform the UW than most people have done in a life-long career. From building countless Impactful Stories for the Boundless site to creating new tools for our users, Teri has created impact not only here in Advancement but across the University."
    },
    {
        "nominee": "Web Strategy Dev Ops Team",
        "unit": "University Marketing and Communications",
        "quote": "Over the past several months, Lauren and Morgen worked hard to prepare and launch a massive upgrade of the infrastructure that powers the UW’s main website and central WordPress content management system. Due in large part to their preparation, planning, and testing, the upgrade was a huge success. In fact, through their efforts, the launch was one of the smoothest and fastest upgrades the team has ever made."
    },
    {
        "nominee": "Marsh, Sean",
        "unit": "UW Bothell",
        "quote": "Sean Marsh shepherded the UW Bothell Advancement team through an extended leadership transition, amidst the many, many, many challenges we all faced during COVID years.  But as anyone who is lucky enough to interact with Sean knows, he is somehow - miraculously? - still smiling and helping us all remember the heart and true purpose of our work.  "
    },
    {
        "nominee": "Hanssen, Debby",
        "unit": "UW Medicine",
        "quote": "Debby Hanssen is a shining star in the UW Medicine Advancement. She is the quintessential team player and collaborator--it's no coincidence that she is on EVERY planning committee, and she wrangles the most complicated schedules to miraculously get many people together when it would be impossible for anyone else to do so."
    },
    {
        "nominee": "Jimenez, Kristine",
        "unit": "UW Medicine",
        "quote": "Kristine has been a great team player and I appreciate her willingness to help regarding working a challenging donor. She has agreed to do a short writing assignment, something typically not asked of her, to help smooth things over. "
    },
    {
        "nominee": "Morris, Ben",
        "unit": "UW Medicine",
        "quote": "Ben goes above and beyond to help his colleagues, always helping where he can. He never says it isn't in his job description and is always there to answer any and all questions the team needs."
    }
]