[
 {
   "nominee": "Jerez, Nelmy",
   "unit": "Annual Philanthropy",
   "quote": "THIS STAR has touched teams across Advancement, from development to marketing to engagement. They turn chaos into order, transforming runaway complexity into details and step-by-step plans, all with a calm and friendly manner. This star knows that in order to succeed, we need to lift each other up. That’s why they routinely pitch in to train colleagues and support projects outside of their role. Nominations for this star repeatedly spoke of their kind and generous spirit – words and phrases included “rarely takes credit,” “joy,” “cheerful,” “friend,” “empathetic,” and “an inspiration.” One nominator said, “Even though I've worked at the UW for more than a dozen years, I find that I learn about how we can improve what we're doing in nearly every interaction with them.” That’s because this star’s role is all about innovation and pushing all of us to make our projects and programs better. With mastery over their area of expertise – analytics – this star contributed to the success of the first Husky Giving Day. They built the Email Benchmark Dashboard and helped teams improve existing email communications with A/B testing and segmentation. When there was a void in Marketo expertise, they were the only person with the skills to move projects forward. And they routinely help us use data to understand our audience better. Every project shines brighter due to this star’s contribution, thanks to their commitment to quality outcomes, collaborative working style and peerless expertise."
 },
 {
    "nominee": ", Brent Ciesliga and Kris Haskins",
    "unit": "Information Management",
    "quote": "If anybody represents \"our best work is done together\" it’s this Star. In fact, I think it’s fair to say that many of us literally could not do our work without them. As we’ve all seen our lives disrupted in ways both dramatic and unprecedented, this awardee has been a North Star for Advancement, steadily and kindly guiding us through a confusing and sometimes frustrating time. They’ve patiently and respectfully answered questions both mundane and complicated, both panicked and routine. Because of them, we never have to \"just Google it.\"\n While this is the way this Star has always done their work, doing it under this level of pressure and uncertainty is what makes them rise to the Star Award level this year. And that pressure includes having to leave the safety of their home to periodically show up at the workplace, all with the goal of keeping Advancement up and running. And by doing so, they’re not only providing an essential service to Advancement employees but also to our stakeholders. Putting my UMAC hat on for a moment, I can tell you that if we weren’t able to successfully use our software and hardware remotely, we would be unable to provide critically important information to students, employees, parents and prospective students — not to mention the broader efforts by Advancement to keep support flowing into this University when and where it needs it most."
},
{
    "nominee": "Kaatz, Jill",
    "unit": "College of Engineering",
    "quote": "This Star was nominated by their Advancement colleagues AND the faculty they work with in recognition of the collaborative, positive and supremely organized leadership they’ve displayed taking on a brand new role and building a one-of-a-kind program. In true embodiment of our UA culture, one nominator said \"This Star is a humble leader and a true team player - they are a very hard worker and yet they are always putting a spotlight on others and lifting them up.\"\nThough they’re no longer in a frontline fundraising role, this Star goes above and beyond cultivating and stewarding new relationships. By discovering what students, faculty and external partners need, this Star built a program from scratch that impacts hundreds of students each year and enriches their UW education.  And through COVID-19, this Star is ensuring that the program can continue, moving activities online for students and industry partners.\n"
},
{
    "nominee": "Dugan, Kevin",
    "unit": "UW Tacoma",
    "quote": "THIS STAR is a quintessential team player, striking the perfect balance between fun and diligence in the workplace, plus THEY are a vital part of our Advancement team and pushing our work forward. One colleague stated, ‘THIS STAR combines internal and external relationship-building to create a powerful, yet understated presence for their Team. THIS STAR consistently secures significant resources, and builds sustainable, perpetual institutional connections. THEY uphold the highest standards in forging both immediate and lasting impacts benefiting the UW Community.’\nTHIS STAR is a mentor to other officers and acts as an example of a disciplined professional for their team. This leadership is not a requirement of THEIR work, but a reflection of THEIR commitment and collegial nature. THIS STAR regularly demonstrates the shared UW values in the work THEY perform, by forming incredibly deep and durable bonds with staff, faculty, students and alumni with THEIR unmatched integrity and strong commitment to innovation, diversity and collaboration.\n THIS STAR’s humility, insistence on sharing successes and fearlessness of failure are inspiring. A fun fact many may not know, THIS STAR is a graduate of UW Tacoma, having worked in the trucking industry before finding access to a higher education on the campus where THEY now provide vital leadership."
},
{
    "nominee": "Haslam, Alex",
    "unit": "College of Built Environments",
    "quote": "This Star is a true Husky – and is a UW alum who got their start in fundraising right here in our Student Calling Program.\n Today, they are recognized as a dynamic, strategic, and collaborative leader – who’s impact is felt across our organization. \nThis Star’s strong reputation is not only known because of their success in fundraising, but also through their time co-chairing the MGO Roundtable and close engagement with Plus Delta’s fundraising cohorts.\nThey are a mentor to countless fundraisers and are a guiding light for so many in our community. They embody the values of being “bright, hardworking, and caring”.\n This Star goes above and beyond, and represents the very best in both University Advancement’s, and the UW’s, values.\n Earlier this year, They excelled while serving in not only one, but two roles. They balanced both by putting in the extra hours and bringing their passion and professionalism to the table.\n As one colleague said, “This Star is a fearless leader who inspires bold visions. They love their work, and care deeply about their team. They give their colleagues every opportunity to shine.”\n Another said that, “This Star has positioned our team to grow exponentially and is a trusted leader across our college’s community.\n They not only inspire donors to make transformative gifts, they inspire their entire team to come together to create impact."
}
]